{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/contingency-tables.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Sep 2021, 14:54:26
{txt}
{com}. //_1
. display c(current_date)
{res}11 Sep 2021
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. set seed 3846
{txt}
{com}. //_4
. label define nickel ///
> 1 "heads for nickel" /// 
> 0 "tails for nickel" // define value label
{txt}
{com}. //_5
. label define quarter /// 
> 1 "heads for quarter" /// 
> 0 "tails for quarter" // define value label
{txt}
{com}. //_6
. set obs 1000 // 1000 observations
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 1,000.
{p_end}

{com}. //_7
. * curiously it takes around 1000 obs for the proportions
. * below to "take hold"
. //_8
. generate nickel = rbinomial(1, .75) // unfair nickel
{txt}
{com}. //_9
. generate quarter = rbinomial(1, .5) // fair quarter
{txt}
{com}. //_10
. label values nickel nickel // assign value label
{txt}
{com}. //_11
. label values quarter quarter // assign value label
{txt}
{com}. //_12
. graph bar, over(nickel) scheme(burd) title(Nickel) name(nickel)
{res}{txt}
{com}. //_13
. graph bar, over(quarter) scheme(burd) title(Quarter) name(quarter)
{res}{txt}
{com}. //_14
. graph combine nickel quarter, title(Nickel And Quarter) scheme(burd)
{res}{txt}
{com}. //_15
. graph export unhelpfulgraph.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/unhelpfulgraph.png{rm}
saved as
PNG
format
{p_end}

{com}. //_16
. tabulate nickel quarter, row col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

                 {c |}        quarter
          nickel {c |} tails for  heads for {c |}     Total
{hline 17}{c +}{hline 22}{c +}{hline 10}
tails for nickel {c |}{res}       104        140 {txt}{c |}{res}       244 
                 {txt}{c |}{res}     42.62      57.38 {txt}{c |}{res}    100.00 
                 {txt}{c |}{res}     21.62      26.97 {txt}{c |}{res}     24.40 
{txt}{hline 17}{c +}{hline 22}{c +}{hline 10}
heads for nickel {c |}{res}       377        379 {txt}{c |}{res}       756 
                 {txt}{c |}{res}     49.87      50.13 {txt}{c |}{res}    100.00 
                 {txt}{c |}{res}     78.38      73.03 {txt}{c |}{res}     75.60 
{txt}{hline 17}{c +}{hline 22}{c +}{hline 10}
           Total {c |}{res}       481        519 {txt}{c |}{res}     1,000 
                 {txt}{c |}{res}     48.10      51.90 {txt}{c |}{res}    100.00 
                 {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. //_17
. * ssc install spineplot // mosaicplots (spineplots)
. //_18
. * ssc install scheme-burd, replace // BuRd graph scheme
. //_19
. spineplot nickel quarter, scheme(burd)
{res}{txt}
{com}. //_20
. graph export nickel-quarter.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/nickel-quarter.png{rm}
saved as
PNG
format
{p_end}

{com}. //_21
. graph bar, over(quarter) over(nickel) scheme(burd)
{res}{txt}
{com}. //_22
. graph export nickel-quarter-bar1.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/nickel-quarter-bar1.png{rm}
saved as
PNG
format
{p_end}

{com}. //_23
. graph bar, over(quarter) over(nickel) scheme(burd) asyvars
{res}{txt}
{com}. //_24
. graph export nickel-quarter-bar2.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/nickel-quarter-bar2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_25
. graph hbar, over(quarter) over(nickel) scheme(burd) asyvars
{res}{txt}
{com}. //_26
. graph export nickel-quarter-bar3.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/nickel-quarter-bar3.png{rm}
saved as
PNG
format
{p_end}

{com}. //_27
. clear all
{res}{txt}
{com}. //_28
. matrix input FrenchSkiiers = (31, 109 \ 17, 122)
{txt}
{com}. //_29
. matrix rownames FrenchSkiiers = Placebo AscorbicAcid
{txt}
{com}. //_30
. matrix colnames FrenchSkiiers = Cold NoCold
{txt}
{com}. //_31
. matrix list FrenchSkiiers
{res}
{txt}FrenchSkiiers[2,2]
                Cold  NoCold
     Placebo {res}     31     109
{txt}AscorbicAcid {res}     17     122
{reset}
{com}. //_32
. svmat FrenchSkiiers, name(count)
{txt}number of observations will be reset to 2
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 2.
{p_end}

{com}. //_33
. list
{txt}
     {c TLC}{hline 8}{c -}{hline 8}{c TRC}
     {c |} {res}count1   count2 {txt}{c |}
     {c LT}{hline 8}{c -}{hline 8}{c RT}
  1. {c |} {res}    31      109 {txt}{c |}
  2. {c |} {res}    17      122 {txt}{c |}
     {c BLC}{hline 8}{c -}{hline 8}{c BRC}

{com}. //_34
. use "FrenchSkiiers.dta", clear
{txt}
{com}. //_35
. list // list the data
{txt}
     {c TLC}{hline 15}{c -}{hline 9}{c -}{hline 7}{c TRC}
     {c |} {res}           Tx   Outcome   Count {txt}{c |}
     {c LT}{hline 15}{c -}{hline 9}{c -}{hline 7}{c RT}
  1. {c |} {res}Ascorbic Acid      Cold      17 {txt}{c |}
  2. {c |} {res}Ascorbic Acid   No Cold     122 {txt}{c |}
  3. {c |} {res}      Placebo      Cold      31 {txt}{c |}
  4. {c |} {res}      Placebo   No Cold     109 {txt}{c |}
     {c BLC}{hline 15}{c -}{hline 9}{c -}{hline 7}{c BRC}

{com}. //_36
. spineplot Tx Outcome, scheme(burd)
{res}{txt}
{com}. //_37
. graph export FrenchSkiiers1.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/FrenchSkiiers1.png{rm}
saved as
PNG
format
{p_end}

{com}. //_38
. spineplot Outcome Tx [fweight=Count], scheme(burd) // order matters to interpretability
{res}{txt}
{com}. //_39
. graph export FrenchSkiiers2.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/FrenchSkiiers2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_40
. tabulate Tx Outcome [fweight = Count], cell row col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c |}{space 2}{it:cell percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

              {c |}        Outcome
           Tx {c |}   No Cold       Cold {c |}     Total
{hline 14}{c +}{hline 22}{c +}{hline 10}
      Placebo {c |}{res}       109         31 {txt}{c |}{res}       140 
              {txt}{c |}{res}     77.86      22.14 {txt}{c |}{res}    100.00 
              {txt}{c |}{res}     47.19      64.58 {txt}{c |}{res}     50.18 
              {txt}{c |}{res}     39.07      11.11 {txt}{c |}{res}     50.18 
{txt}{hline 14}{c +}{hline 22}{c +}{hline 10}
Ascorbic Acid {c |}{res}       122         17 {txt}{c |}{res}       139 
              {txt}{c |}{res}     87.77      12.23 {txt}{c |}{res}    100.00 
              {txt}{c |}{res}     52.81      35.42 {txt}{c |}{res}     49.82 
              {txt}{c |}{res}     43.73       6.09 {txt}{c |}{res}     49.82 
{txt}{hline 14}{c +}{hline 22}{c +}{hline 10}
        Total {c |}{res}       231         48 {txt}{c |}{res}       279 
              {txt}{c |}{res}     82.80      17.20 {txt}{c |}{res}    100.00 
              {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
              {txt}{c |}{res}     82.80      17.20 {txt}{c |}{res}    100.00 
{txt}
{com}. //_41
. display 6.09 / 49.82
{res}.12224006
{txt}
{com}. //_42
. display 17/139
{res}.12230216
{txt}
{com}. //_43
. tabulate Tx Outcome [fweight = Count]

              {txt}{c |}        Outcome
           Tx {c |}   No Cold       Cold {c |}     Total
{hline 14}{c +}{hline 22}{c +}{hline 10}
      Placebo {c |}{res}       109         31 {txt}{c |}{res}       140 
{txt}Ascorbic Acid {c |}{res}       122         17 {txt}{c |}{res}       139 
{txt}{hline 14}{c +}{hline 22}{c +}{hline 10}
        Total {c |}{res}       231         48 {txt}{c |}{res}       279 
{txt}
{com}. //_44
. scalar N = 31 + 109 + 17 + 122
{txt}
{com}. //_45
. scalar A = ((31 + 17)*(31 + 109)) / N // expected count
{txt}
{com}. //_46
. scalar B = ((31 + 109)*(109 + 122)) / N // expected count
{txt}
{com}. //_47
. scalar C = ((31 + 17) * (17 + 122)) / N // expected count
{txt}
{com}. //_48
. scalar D = ((17 + 122) * (109 + 122)) / N // expected count
{txt}
{com}. //_49
. matrix FS = (A, B \ C, D) // matrix of expected values
{txt}
{com}. //_50
. matrix rownames FS = Placebo AscorbicAcid // rownames
{txt}
{com}. //_51
. matrix colnames FS = Cold NoCold // column names
{txt}
{com}. //_52
. matrix list FS
{res}
{txt}FS[2,2]
                   Cold     NoCold
     Placebo {res} 24.086022  115.91398
{txt}AscorbicAcid {res} 23.913978  115.08602
{reset}
{com}. //_53
. scalar chisquare = (31 - 24.086022)^2 / 24.086022 + /// 
> (109 - 115.91398)^2 / 115.91398 + ///
> (17 - 23.913978)^2 / 23.913978 + /// 
> (122 - 115.08602)^2 / 115.08602
{txt}
{com}. //_54
. scalar list chisquare
{txt} chisquare = {res} 4.8114124
{txt}
{com}. //_55
. use "FrenchSkiiers.dta", clear
{txt}
{com}. //_56
. tabulate Tx Outcome [fweight = Count], row col chi2
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

              {c |}        Outcome
           Tx {c |}   No Cold       Cold {c |}     Total
{hline 14}{c +}{hline 22}{c +}{hline 10}
      Placebo {c |}{res}       109         31 {txt}{c |}{res}       140 
              {txt}{c |}{res}     77.86      22.14 {txt}{c |}{res}    100.00 
              {txt}{c |}{res}     47.19      64.58 {txt}{c |}{res}     50.18 
{txt}{hline 14}{c +}{hline 22}{c +}{hline 10}
Ascorbic Acid {c |}{res}       122         17 {txt}{c |}{res}       139 
              {txt}{c |}{res}     87.77      12.23 {txt}{c |}{res}    100.00 
              {txt}{c |}{res}     52.81      35.42 {txt}{c |}{res}     49.82 
{txt}{hline 14}{c +}{hline 22}{c +}{hline 10}
        Total {c |}{res}       231         48 {txt}{c |}{res}       279 
              {txt}{c |}{res}     82.80      17.20 {txt}{c |}{res}    100.00 
              {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 

{txt}          Pearson chi2({res}1{txt}) = {res}  4.8114  {txt} Pr = {res}0.028
{txt}
{com}. //_57
. tabulate Outcome Tx [fweight = Count]

           {txt}{c |}          Tx
   Outcome {c |}   Placebo  Ascorbic  {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
   No Cold {c |}{res}       109        122 {txt}{c |}{res}       231 
{txt}      Cold {c |}{res}        31         17 {txt}{c |}{res}        48 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       140        139 {txt}{c |}{res}       279 
{txt}
{com}. //_58
. tabulate Outcome Tx [fweight = Count], col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}          Tx
   Outcome {c |}   Placebo  Ascorbic  {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
   No Cold {c |}{res}       109        122 {txt}{c |}{res}       231 
           {txt}{c |}{res}     77.86      87.77 {txt}{c |}{res}     82.80 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
      Cold {c |}{res}        31         17 {txt}{c |}{res}        48 
           {txt}{c |}{res}     22.14      12.23 {txt}{c |}{res}     17.20 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       140        139 {txt}{c |}{res}       279 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. //_59
. display 31/140
{res}.22142857
{txt}
{com}. //_60
. display 17/139
{res}.12230216
{txt}
{com}. //_61
. display (17/139) / (31/140)
{res}.55233233
{txt}
{com}. //_62
. csi 17 31 122 109 // also has an intuitive dialog box

{txt}{col 18}{c |}   Exposed   Unexposed  {c |}      Total
{hline 17}{c +}{hline 24}{c +}{hline 11}
           Cases {c |} {res}       17          31{txt}  {c |}  {res}       48
        {txt}Noncases {c |} {res}      122         109{txt}  {c |}  {res}      231
{txt}{hline 17}{c +}{hline 24}{c +}{hline 11}
{col 12}Total {c |} {res}      139         140{txt}  {c |}  {res}      279
{txt}{col 18}{c |}{col 43}{c |}
            Risk {c |} {res} .1223022    .2214286{txt}  {c |}  {res}  .172043
{txt}{col 18}{c |}{col 43}{c |}
{col 18}{c |}      Point estimate    {c |}    [95% conf. interval]
{col 18}{c LT}{hline 24}{c +}{hline 24}
 Risk difference {c |} {res}{col 27}-.0991264{txt}{col 43}{c |}   {res}-.1868592   -.0113937{txt} 
      Risk ratio {c |} {res}{col 27} .5523323{txt}{col 43}{c |}   {res} .3209178    .9506203{txt} 
 Prev. frac. ex. {c |} {res}{col 27} .4476677{txt}{col 43}{c |}   {res} .0493797    .6790822{txt} 
 Prev. frac. pop {c |} {res}{col 27} .2230316{txt}{col 43}{c |}
{col 18}{c BLC}{hline 24}{c BT}{hline 24}
{col 22}          chi2(1) ={res}     4.81{txt}  Pr>chi2 ={res} 0.0283
{txt}
{com}. //_63
. tabulate Tx Outcome [fweight = Count]

              {txt}{c |}        Outcome
           Tx {c |}   No Cold       Cold {c |}     Total
{hline 14}{c +}{hline 22}{c +}{hline 10}
      Placebo {c |}{res}       109         31 {txt}{c |}{res}       140 
{txt}Ascorbic Acid {c |}{res}       122         17 {txt}{c |}{res}       139 
{txt}{hline 14}{c +}{hline 22}{c +}{hline 10}
        Total {c |}{res}       231         48 {txt}{c |}{res}       279 
{txt}
{com}. //_64
. display (17 * 109)/(122 * 31)
{res}.48995241
{txt}
{com}. //_65
. csi 17 31 122 109, or // also has an intuitive dialog box

{txt}{col 18}{c |}   Exposed   Unexposed  {c |}      Total
{hline 17}{c +}{hline 24}{c +}{hline 11}
           Cases {c |} {res}       17          31{txt}  {c |}  {res}       48
        {txt}Noncases {c |} {res}      122         109{txt}  {c |}  {res}      231
{txt}{hline 17}{c +}{hline 24}{c +}{hline 11}
{col 12}Total {c |} {res}      139         140{txt}  {c |}  {res}      279
{txt}{col 18}{c |}{col 43}{c |}
            Risk {c |} {res} .1223022    .2214286{txt}  {c |}  {res}  .172043
{txt}{col 18}{c |}{col 43}{c |}
{col 18}{c |}      Point estimate    {c |}    [95% conf. interval]
{col 18}{c LT}{hline 24}{c +}{hline 24}
 Risk difference {c |} {res}{col 27}-.0991264{txt}{col 43}{c |}   {res}-.1868592   -.0113937{txt} 
      Risk ratio {c |} {res}{col 27} .5523323{txt}{col 43}{c |}   {res} .3209178    .9506203{txt} 
 Prev. frac. ex. {c |} {res}{col 27} .4476677{txt}{col 43}{c |}   {res} .0493797    .6790822{txt} 
 Prev. frac. pop {c |} {res}{col 27} .2230316{txt}{col 43}{c |}
      Odds ratio {c |} {res}{col 27} .4899524{txt}{col 43}{c |}   {res} .2588072    .9282861{txt} (Cornfield)
{col 18}{c BLC}{hline 24}{c BT}{hline 24}
{col 22}          chi2(1) ={res}     4.81{txt}  Pr>chi2 ={res} 0.0283
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/contingency-tables/contingency-tables.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 Sep 2021, 14:54:44
{txt}{.-}
{smcl}
{txt}{sf}{ul off}