{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/ordinal-multinomial-logistic-regression/ordinal-multinomial-logistic-regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Oct 2023, 12:40:44
{txt}
{com}. //_1
. display c(current_date)
{res}15 Oct 2023
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. set maxvar 10000 // increase number of allowable variables

{txt}
{com}. //_4
. use "GSSsmall.DTA", clear
{txt}
{com}. //_5
. keep polviews sex maeduc paeduc age degree coninc
{txt}
{com}. //_6
. save GSSsmall.dta, replace
{txt}{p 0 4 2}
file {bf}
GSSsmall.dta{rm}
saved
{p_end}

{com}. //_7
. describe // describe the data

{txt}Contains data from {res}GSSsmall.dta
{txt} Observations:{res}        64,814                  
{txt}    Variables:{res}             7                  15 Oct 2023 12:40
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:age            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:AGE      }{bind:  }{res}{res}age of respondent{p_end}
{p 0 48}{bind:paeduc         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABK     }{bind:  }{res}{res}highest year school completed, father{p_end}
{p 0 48}{bind:maeduc         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABK     }{bind:  }{res}{res}highest year school completed, mother{p_end}
{p 0 48}{bind:degree         }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:LABL     }{bind:  }{res}{res}r's highest degree{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:SEX      }{bind:  }{res}{res}respondents sex{p_end}
{p 0 48}{bind:polviews       }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:POLVIEWS }{bind:  }{res}{res}think of self as liberal or conservative{p_end}
{p 0 48}{bind:coninc         }{txt}{bind: double  }{bind:%12.0g    }{space 1}{bind:LABIH    }{bind:  }{res}{res}family income in constant dollars{p_end}
{txt}{hline}
Sorted by: 

{com}. //_8
. summarize 

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}     64,586    46.09936     17.5347         18         89
{txt}{space 6}paeduc {c |}{res}     45,837    10.71026    4.342689          0         20
{txt}{space 6}maeduc {c |}{res}     53,870    10.85365    3.768792          0         20
{txt}{space 6}degree {c |}{res}     64,641     1.35858    1.175289          0          4
{txt}{space 9}sex {c |}{res}     64,814    1.558521    .4965673          1          2
{txt}{hline 13}{c +}{hline 57}
{space 4}polviews {c |}{res}     55,328    4.100528    1.382474          1          7
{txt}{space 6}coninc {c |}{res}     58,294    45028.17       36791      350.5     180386
{txt}
{com}. //_9
. tabulate polviews

    {txt}think of self as {c |}
          liberal or {c |}
        conservative {c |}      Freq.     Percent        Cum.
{hline 21}{c +}{hline 35}
   extremely liberal {c |}{res}      1,682        3.04        3.04
{txt}             liberal {c |}{res}      6,514       11.77       14.81
{txt}    slightly liberal {c |}{res}      7,010       12.67       27.48
{txt}            moderate {c |}{res}     21,370       38.62       66.11
{txt}slghtly conservative {c |}{res}      8,690       15.71       81.81
{txt}        conservative {c |}{res}      8,230       14.87       96.69
{txt}extrmly conservative {c |}{res}      1,832        3.31      100.00
{txt}{hline 21}{c +}{hline 35}
               Total {c |}{res}     55,328      100.00
{txt}
{com}. //_10
. ologit polviews sex age degree coninc

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-83895.058}  
Iteration 1:{space 2}Log likelihood = {res:-83369.429}  
Iteration 2:{space 2}Log likelihood = {res:-83368.485}  
Iteration 3:{space 2}Log likelihood = {res:-83368.485}  
{res}
{txt}{col 1}Ordered logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:50,049}
{txt}{col 56}{lalign 13:LR chi2({res:4})}{col 69} = {res}{ralign 7:1053.15}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-83368.485}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0063}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    polviews{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}{col 14}{res}{space 2} -.129234{col 26}{space 2} .0162348{col 37}{space 1}   -7.96{col 46}{space 3}0.000{col 54}{space 4}-.1610536{col 67}{space 3}-.0974144
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0116653{col 26}{space 2} .0004737{col 37}{space 1}   24.63{col 46}{space 3}0.000{col 54}{space 4} .0107369{col 67}{space 3} .0125937
{txt}{space 6}degree {c |}{col 14}{res}{space 2}-.1062661{col 26}{space 2} .0076242{col 37}{space 1}  -13.94{col 46}{space 3}0.000{col 54}{space 4}-.1212093{col 67}{space 3} -.091323
{txt}{space 6}coninc {c |}{col 14}{res}{space 2} 3.99e-06{col 26}{space 2} 2.42e-07{col 37}{space 1}   16.52{col 46}{space 3}0.000{col 54}{space 4} 3.52e-06{col 67}{space 3} 4.46e-06
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/cut1 {c |}{col 14}{res}{space 2}-3.116098{col 26}{space 2} .0440989{col 54}{space 4}-3.202531{col 67}{space 3}-3.029666
{txt}{space 7}/cut2 {c |}{col 14}{res}{space 2}-1.389623{col 26}{space 2} .0379027{col 54}{space 4}-1.463911{col 67}{space 3}-1.315335
{txt}{space 7}/cut3 {c |}{col 14}{res}{space 2}-.5941761{col 26}{space 2} .0372164{col 54}{space 4}-.6671188{col 67}{space 3}-.5212333
{txt}{space 7}/cut4 {c |}{col 14}{res}{space 2} 1.050951{col 26}{space 2}  .037438{col 54}{space 4} .9775742{col 67}{space 3} 1.124329
{txt}{space 7}/cut5 {c |}{col 14}{res}{space 2} 1.916652{col 26}{space 2}   .03824{col 54}{space 4} 1.841703{col 67}{space 3} 1.991601
{txt}{space 7}/cut6 {c |}{col 14}{res}{space 2} 3.826484{col 26}{space 2} .0447146{col 54}{space 4} 3.738845{col 67}{space 3} 3.914123
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_11
. ologit polviews sex age degree coninc, or

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-83895.058}  
Iteration 1:{space 2}Log likelihood = {res:-83369.429}  
Iteration 2:{space 2}Log likelihood = {res:-83368.485}  
Iteration 3:{space 2}Log likelihood = {res:-83368.485}  
{res}
{txt}{col 1}Ordered logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:50,049}
{txt}{col 56}{lalign 13:LR chi2({res:4})}{col 69} = {res}{ralign 7:1053.15}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-83368.485}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0063}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    polviews{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}{col 14}{res}{space 2} .8787683{col 26}{space 2} .0142666{col 37}{space 1}   -7.96{col 46}{space 3}0.000{col 54}{space 4} .8512464{col 67}{space 3}   .90718
{txt}{space 9}age {c |}{col 14}{res}{space 2} 1.011734{col 26}{space 2} .0004792{col 37}{space 1}   24.63{col 46}{space 3}0.000{col 54}{space 4} 1.010795{col 67}{space 3} 1.012673
{txt}{space 6}degree {c |}{col 14}{res}{space 2} .8991853{col 26}{space 2} .0068555{col 37}{space 1}  -13.94{col 46}{space 3}0.000{col 54}{space 4} .8858486{col 67}{space 3} .9127228
{txt}{space 6}coninc {c |}{col 14}{res}{space 2} 1.000004{col 26}{space 2} 2.42e-07{col 37}{space 1}   16.52{col 46}{space 3}0.000{col 54}{space 4} 1.000004{col 67}{space 3} 1.000004
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/cut1 {c |}{col 14}{res}{space 2}-3.116098{col 26}{space 2} .0440989{col 54}{space 4}-3.202531{col 67}{space 3}-3.029666
{txt}{space 7}/cut2 {c |}{col 14}{res}{space 2}-1.389623{col 26}{space 2} .0379027{col 54}{space 4}-1.463911{col 67}{space 3}-1.315335
{txt}{space 7}/cut3 {c |}{col 14}{res}{space 2}-.5941761{col 26}{space 2} .0372164{col 54}{space 4}-.6671188{col 67}{space 3}-.5212333
{txt}{space 7}/cut4 {c |}{col 14}{res}{space 2} 1.050951{col 26}{space 2}  .037438{col 54}{space 4} .9775742{col 67}{space 3} 1.124329
{txt}{space 7}/cut5 {c |}{col 14}{res}{space 2} 1.916652{col 26}{space 2}   .03824{col 54}{space 4} 1.841703{col 67}{space 3} 1.991601
{txt}{space 7}/cut6 {c |}{col 14}{res}{space 2} 3.826484{col 26}{space 2} .0447146{col 54}{space 4} 3.738845{col 67}{space 3} 3.914123
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation to odds ratios.{p_end}

{com}. //_12
. brant
{res}
{txt}{p 0 0 2}Brant test of parallel regression assumption{p_end}

{space 1}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 10:chi2}{space 1}{space 1}{ralign 9:p>chi2}{space 1}{space 1}{ralign 6:df}{space 0}
{space 1}{hline 13}{c   +}{hline 12}{hline 11}{hline 7}
{space 1}{space 0}{ralign 12:All}{space 1}{c |}{space 1}{ralign 10:{res:{sf:   1456.59}}}{space 1}{space 1}{ralign 9:{res:{sf:    0.000}}}{space 1}{space 1}{ralign 6:{res:{sf:    20}}}{space 0}
{space 1}{hline 13}{c   +}{hline 12}{hline 11}{hline 7}
{space 1}{space 0}{ralign 12:sex}{space 1}{c |}{space 1}{ralign 10:{res:{sf:    108.03}}}{space 1}{space 1}{ralign 9:{res:{sf:    0.000}}}{space 1}{space 1}{ralign 6:{res:{sf:     5}}}{space 0}
{space 1}{space 0}{ralign 12:age}{space 1}{c |}{space 1}{ralign 10:{res:{sf:    120.63}}}{space 1}{space 1}{ralign 9:{res:{sf:    0.000}}}{space 1}{space 1}{ralign 6:{res:{sf:     5}}}{space 0}
{space 1}{space 0}{ralign 12:degree}{space 1}{c |}{space 1}{ralign 10:{res:{sf:    835.26}}}{space 1}{space 1}{ralign 9:{res:{sf:    0.000}}}{space 1}{space 1}{ralign 6:{res:{sf:     5}}}{space 0}
{space 1}{space 0}{ralign 12:coninc}{space 1}{c |}{space 1}{ralign 10:{res:{sf:     67.78}}}{space 1}{space 1}{ralign 9:{res:{sf:    0.000}}}{space 1}{space 1}{ralign 6:{res:{sf:     5}}}{space 0}

A significant test statistic provides evidence that the parallel
regression assumption has been violated.

{com}. //_13
. mlogit polviews i.sex age degree coninc

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-83895.058}  
Iteration 1:{space 2}Log likelihood = {res:-82700.548}  
Iteration 2:{space 2}Log likelihood = {res:-82694.595}  
Iteration 3:{space 2}Log likelihood = {res:-82694.594}  
{res}
{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:50,049}
{txt}{col 56}{lalign 13:LR chi2({res:24})}{col 69} = {res}{ralign 7:2400.93}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-82694.594}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0143}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            polviews{col 22}{c |} Coefficient{col 34}  Std. err.{col 46}      z{col 54}   P>|z|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}extremely_liberal    {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2}-.2153043{col 34}{space 2} .0534275{col 45}{space 1}   -4.03{col 54}{space 3}0.000{col 62}{space 4}-.3200202{col 75}{space 3}-.1105883
{txt}{space 17}age {c |}{col 22}{res}{space 2}-.0051601{col 34}{space 2} .0015774{col 45}{space 1}   -3.27{col 54}{space 3}0.001{col 62}{space 4}-.0082517{col 75}{space 3}-.0020685
{txt}{space 14}degree {c |}{col 22}{res}{space 2} .3607061{col 34}{space 2} .0234865{col 45}{space 1}   15.36{col 54}{space 3}0.000{col 62}{space 4} .3146735{col 75}{space 3} .4067387
{txt}{space 14}coninc {c |}{col 22}{res}{space 2}-6.68e-06{col 34}{space 2} 8.90e-07{col 45}{space 1}   -7.51{col 54}{space 3}0.000{col 62}{space 4}-8.43e-06{col 75}{space 3}-4.94e-06
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} -2.40105{col 34}{space 2} .0904486{col 45}{space 1}  -26.55{col 54}{space 3}0.000{col 62}{space 4}-2.578326{col 75}{space 3}-2.223774
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}liberal              {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2}-.0770042{col 34}{space 2} .0302144{col 45}{space 1}   -2.55{col 54}{space 3}0.011{col 62}{space 4}-.1362233{col 75}{space 3}-.0177851
{txt}{space 17}age {c |}{col 22}{res}{space 2}-.0077271{col 34}{space 2} .0009041{col 45}{space 1}   -8.55{col 54}{space 3}0.000{col 62}{space 4}-.0094991{col 75}{space 3}-.0059551
{txt}{space 14}degree {c |}{col 22}{res}{space 2} .3615385{col 34}{space 2} .0134905{col 45}{space 1}   26.80{col 54}{space 3}0.000{col 62}{space 4} .3350977{col 75}{space 3} .3879794
{txt}{space 14}coninc {c |}{col 22}{res}{space 2}-2.36e-06{col 34}{space 2} 4.59e-07{col 45}{space 1}   -5.14{col 54}{space 3}0.000{col 62}{space 4}-3.26e-06{col 75}{space 3}-1.46e-06
{txt}{space 15}_cons {c |}{col 22}{res}{space 2}-1.195919{col 34}{space 2} .0513843{col 45}{space 1}  -23.27{col 54}{space 3}0.000{col 62}{space 4} -1.29663{col 75}{space 3}-1.095207
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}slightly_liberal     {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2}-.1016619{col 34}{space 2} .0292053{col 45}{space 1}   -3.48{col 54}{space 3}0.000{col 62}{space 4}-.1589032{col 75}{space 3}-.0444206
{txt}{space 17}age {c |}{col 22}{res}{space 2}-.0099768{col 34}{space 2} .0008799{col 45}{space 1}  -11.34{col 54}{space 3}0.000{col 62}{space 4}-.0117014{col 75}{space 3}-.0082521
{txt}{space 14}degree {c |}{col 22}{res}{space 2} .2358701{col 34}{space 2} .0134562{col 45}{space 1}   17.53{col 54}{space 3}0.000{col 62}{space 4} .2094964{col 75}{space 3} .2622438
{txt}{space 14}coninc {c |}{col 22}{res}{space 2}-1.94e-07{col 34}{space 2} 4.37e-07{col 45}{space 1}   -0.44{col 54}{space 3}0.658{col 62}{space 4}-1.05e-06{col 75}{space 3} 6.63e-07
{txt}{space 15}_cons {c |}{col 22}{res}{space 2}  -.90455{col 34}{space 2} .0494119{col 45}{space 1}  -18.31{col 54}{space 3}0.000{col 62}{space 4}-1.001396{col 75}{space 3}-.8077044
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}moderate            {col 22}{txt}{c |}  (base outcome)
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}slghtly_conservative {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2}-.2630355{col 34}{space 2} .0270206{col 45}{space 1}   -9.73{col 54}{space 3}0.000{col 62}{space 4} -.315995{col 75}{space 3} -.210076
{txt}{space 17}age {c |}{col 22}{res}{space 2} .0012542{col 34}{space 2} .0007943{col 45}{space 1}    1.58{col 54}{space 3}0.114{col 62}{space 4}-.0003026{col 75}{space 3}  .002811
{txt}{space 14}degree {c |}{col 22}{res}{space 2} .1963805{col 34}{space 2}  .012493{col 45}{space 1}   15.72{col 54}{space 3}0.000{col 62}{space 4} .1718947{col 75}{space 3} .2208663
{txt}{space 14}coninc {c |}{col 22}{res}{space 2} 3.39e-06{col 34}{space 2} 3.86e-07{col 45}{space 1}    8.79{col 54}{space 3}0.000{col 62}{space 4} 2.63e-06{col 75}{space 3} 4.15e-06
{txt}{space 15}_cons {c |}{col 22}{res}{space 2}-1.221032{col 34}{space 2} .0467118{col 45}{space 1}  -26.14{col 54}{space 3}0.000{col 62}{space 4}-1.312585{col 75}{space 3}-1.129479
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}conservative         {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2}-.2625249{col 34}{space 2} .0278997{col 45}{space 1}   -9.41{col 54}{space 3}0.000{col 62}{space 4}-.3172073{col 75}{space 3}-.2078426
{txt}{space 17}age {c |}{col 22}{res}{space 2} .0128524{col 34}{space 2}  .000801{col 45}{space 1}   16.05{col 54}{space 3}0.000{col 62}{space 4} .0112825{col 75}{space 3} .0144224
{txt}{space 14}degree {c |}{col 22}{res}{space 2}  .152561{col 34}{space 2} .0129671{col 45}{space 1}   11.77{col 54}{space 3}0.000{col 62}{space 4}  .127146{col 75}{space 3}  .177976
{txt}{space 14}coninc {c |}{col 22}{res}{space 2} 3.87e-06{col 34}{space 2} 3.97e-07{col 45}{space 1}    9.75{col 54}{space 3}0.000{col 62}{space 4} 3.09e-06{col 75}{space 3} 4.65e-06
{txt}{space 15}_cons {c |}{col 22}{res}{space 2}-1.813802{col 34}{space 2} .0496044{col 45}{space 1}  -36.57{col 54}{space 3}0.000{col 62}{space 4}-1.911025{col 75}{space 3}-1.716579
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}extrmly_conservative {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2}-.3790287{col 34}{space 2} .0530006{col 45}{space 1}   -7.15{col 54}{space 3}0.000{col 62}{space 4} -.482908{col 75}{space 3}-.2751493
{txt}{space 17}age {c |}{col 22}{res}{space 2} .0150308{col 34}{space 2} .0014834{col 45}{space 1}   10.13{col 54}{space 3}0.000{col 62}{space 4} .0121235{col 75}{space 3} .0179381
{txt}{space 14}degree {c |}{col 22}{res}{space 2}  .004062{col 34}{space 2} .0262081{col 45}{space 1}    0.15{col 54}{space 3}0.877{col 62}{space 4}-.0473049{col 75}{space 3}  .055429
{txt}{space 14}coninc {c |}{col 22}{res}{space 2} 3.35e-07{col 34}{space 2} 8.19e-07{col 45}{space 1}    0.41{col 54}{space 3}0.682{col 62}{space 4}-1.27e-06{col 75}{space 3} 1.94e-06
{txt}{space 15}_cons {c |}{col 22}{res}{space 2}-3.040997{col 34}{space 2} .0945989{col 45}{space 1}  -32.15{col 54}{space 3}0.000{col 62}{space 4}-3.226407{col 75}{space 3}-2.855587
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_14
. mlogit, rr

{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:50,049}
{txt}{col 56}{lalign 13:LR chi2({res:24})}{col 69} = {res}{ralign 7:2400.93}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-82694.594}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0143}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            polviews{col 22}{c |}        RRR{col 34}   Std. err.{col 46}      z{col 54}   P>|z|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}extremely_liberal    {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2} .8062961{col 34}{space 2} .0430784{col 45}{space 1}   -4.03{col 54}{space 3}0.000{col 62}{space 4} .7261343{col 75}{space 3} .8953073
{txt}{space 17}age {c |}{col 22}{res}{space 2} .9948532{col 34}{space 2} .0015693{col 45}{space 1}   -3.27{col 54}{space 3}0.001{col 62}{space 4} .9917823{col 75}{space 3} .9979336
{txt}{space 14}degree {c |}{col 22}{res}{space 2} 1.434342{col 34}{space 2} .0336876{col 45}{space 1}   15.36{col 54}{space 3}0.000{col 62}{space 4} 1.369812{col 75}{space 3} 1.501912
{txt}{space 14}coninc {c |}{col 22}{res}{space 2} .9999933{col 34}{space 2} 8.90e-07{col 45}{space 1}   -7.51{col 54}{space 3}0.000{col 62}{space 4} .9999916{col 75}{space 3} .9999951
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .0906228{col 34}{space 2} .0081967{col 45}{space 1}  -26.55{col 54}{space 3}0.000{col 62}{space 4}  .075901{col 75}{space 3}    .1082
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}liberal              {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2}  .925886{col 34}{space 2} .0279751{col 45}{space 1}   -2.55{col 54}{space 3}0.011{col 62}{space 4} .8726477{col 75}{space 3} .9823721
{txt}{space 17}age {c |}{col 22}{res}{space 2} .9923027{col 34}{space 2} .0008971{col 45}{space 1}   -8.55{col 54}{space 3}0.000{col 62}{space 4} .9905458{col 75}{space 3} .9940626
{txt}{space 14}degree {c |}{col 22}{res}{space 2} 1.435536{col 34}{space 2} .0193661{col 45}{space 1}   26.80{col 54}{space 3}0.000{col 62}{space 4} 1.398077{col 75}{space 3} 1.473999
{txt}{space 14}coninc {c |}{col 22}{res}{space 2} .9999976{col 34}{space 2} 4.59e-07{col 45}{space 1}   -5.14{col 54}{space 3}0.000{col 62}{space 4} .9999967{col 75}{space 3} .9999985
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .3024259{col 34}{space 2}   .01554{col 45}{space 1}  -23.27{col 54}{space 3}0.000{col 62}{space 4} .2734517{col 75}{space 3} .3344702
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}slightly_liberal     {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2} .9033349{col 34}{space 2} .0263822{col 45}{space 1}   -3.48{col 54}{space 3}0.000{col 62}{space 4} .8530789{col 75}{space 3} .9565515
{txt}{space 17}age {c |}{col 22}{res}{space 2} .9900729{col 34}{space 2} .0008712{col 45}{space 1}  -11.34{col 54}{space 3}0.000{col 62}{space 4} .9883668{col 75}{space 3} .9917818
{txt}{space 14}degree {c |}{col 22}{res}{space 2}  1.26601{col 34}{space 2} .0170357{col 45}{space 1}   17.53{col 54}{space 3}0.000{col 62}{space 4} 1.233057{col 75}{space 3} 1.299843
{txt}{space 14}coninc {c |}{col 22}{res}{space 2} .9999998{col 34}{space 2} 4.37e-07{col 45}{space 1}   -0.44{col 54}{space 3}0.658{col 62}{space 4} .9999989{col 75}{space 3} 1.000001
{txt}{space 15}_cons {c |}{col 22}{res}{space 2}  .404724{col 34}{space 2} .0199982{col 45}{space 1}  -18.31{col 54}{space 3}0.000{col 62}{space 4} .3673664{col 75}{space 3} .4458805
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}moderate            {col 22}{txt}{c |}  (base outcome)
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}slghtly_conservative {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2} .7687146{col 34}{space 2} .0207712{col 45}{space 1}   -9.73{col 54}{space 3}0.000{col 62}{space 4} .7290631{col 75}{space 3} .8105226
{txt}{space 17}age {c |}{col 22}{res}{space 2} 1.001255{col 34}{space 2} .0007953{col 45}{space 1}    1.58{col 54}{space 3}0.114{col 62}{space 4} .9996975{col 75}{space 3} 1.002815
{txt}{space 14}degree {c |}{col 22}{res}{space 2}  1.21699{col 34}{space 2} .0152038{col 45}{space 1}   15.72{col 54}{space 3}0.000{col 62}{space 4} 1.187553{col 75}{space 3} 1.247157
{txt}{space 14}coninc {c |}{col 22}{res}{space 2} 1.000003{col 34}{space 2} 3.86e-07{col 45}{space 1}    8.79{col 54}{space 3}0.000{col 62}{space 4} 1.000003{col 75}{space 3} 1.000004
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .2949256{col 34}{space 2} .0137765{col 45}{space 1}  -26.14{col 54}{space 3}0.000{col 62}{space 4} .2691234{col 75}{space 3} .3232017
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}conservative         {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2} .7691072{col 34}{space 2} .0214578{col 45}{space 1}   -9.41{col 54}{space 3}0.000{col 62}{space 4} .7281798{col 75}{space 3} .8123349
{txt}{space 17}age {c |}{col 22}{res}{space 2} 1.012935{col 34}{space 2} .0008114{col 45}{space 1}   16.05{col 54}{space 3}0.000{col 62}{space 4} 1.011346{col 75}{space 3} 1.014527
{txt}{space 14}degree {c |}{col 22}{res}{space 2} 1.164814{col 34}{space 2} .0151042{col 45}{space 1}   11.77{col 54}{space 3}0.000{col 62}{space 4} 1.135583{col 75}{space 3} 1.194797
{txt}{space 14}coninc {c |}{col 22}{res}{space 2} 1.000004{col 34}{space 2} 3.97e-07{col 45}{space 1}    9.75{col 54}{space 3}0.000{col 62}{space 4} 1.000003{col 75}{space 3} 1.000005
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .1630332{col 34}{space 2} .0080872{col 45}{space 1}  -36.57{col 54}{space 3}0.000{col 62}{space 4} .1479287{col 75}{space 3} .1796798
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}extrmly_conservative {txt}{c |}
{space 17}sex {c |}
{space 13}female  {c |}{col 22}{res}{space 2}  .684526{col 34}{space 2} .0362803{col 45}{space 1}   -7.15{col 54}{space 3}0.000{col 62}{space 4} .6169866{col 75}{space 3} .7594587
{txt}{space 17}age {c |}{col 22}{res}{space 2} 1.015144{col 34}{space 2} .0015058{col 45}{space 1}   10.13{col 54}{space 3}0.000{col 62}{space 4} 1.012197{col 75}{space 3}   1.0181
{txt}{space 14}degree {c |}{col 22}{res}{space 2}  1.00407{col 34}{space 2} .0263148{col 45}{space 1}    0.15{col 54}{space 3}0.877{col 62}{space 4} .9537966{col 75}{space 3} 1.056994
{txt}{space 14}coninc {c |}{col 22}{res}{space 2}        1{col 34}{space 2} 8.19e-07{col 45}{space 1}    0.41{col 54}{space 3}0.682{col 62}{space 4} .9999987{col 75}{space 3} 1.000002
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .0477872{col 34}{space 2} .0045206{col 45}{space 1}  -32.15{col 54}{space 3}0.000{col 62}{space 4} .0396999{col 75}{space 3} .0575221
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline relative risk{txt} for each outcome{txt}.{p_end}

{com}. //_15
. margins sex, predict(outcome(1)) // predicted probabilities by sex; y = 1
{res}
{txt}{col 1}Predictive margins{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:50,049}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(polviews==extremely_liberal), predict(outcome(1))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}
{space 7}male  {c |}{col 14}{res}{space 2} .0325114{col 26}{space 2}  .001187{col 37}{space 1}   27.39{col 46}{space 3}0.000{col 54}{space 4} .0301849{col 67}{space 3} .0348378
{txt}{space 5}female  {c |}{col 14}{res}{space 2} .0295928{col 26}{space 2} .0010205{col 37}{space 1}   29.00{col 46}{space 3}0.000{col 54}{space 4} .0275927{col 67}{space 3}  .031593
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/ordinal-multinomial-logistic-regression/ordinal-multinomial-logistic-regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Oct 2023, 12:40:57
{txt}{.-}
{smcl}
{txt}{sf}{ul off}