{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-regression-the-basics/logistic-regression-the-basics.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 May 2021, 09:46:57
{txt}
{com}. //_1
. display c(current_date)
{res} 3 May 2021
{txt}
{com}. //_2
. display c(current_time)
{res}09:46:57
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. graph close _all
{txt}
{com}. //_5
. use http://www.stata-press.com/data/r15/margex, clear
{txt}(Artificial data for margins)

{com}. //_6
. describe

{txt}Contains data from {res}http://www.stata-press.com/data/r15/margex.dta
{txt} Observations:{res}         3,000                  Artificial data for margins
{txt}    Variables:{res}            11                  27 Nov 2016 14:27
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:y              }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:outcome        }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:{txt}%6.0f     }{space 1}{bind:sexlbl   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:group          }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age            }{txt}{bind: float   }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:distance       }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ycn            }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:yc             }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:treatment      }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:agegroup       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:agelab   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:arm            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}group
{txt}
{com}. //_7
. logit outcome i.sex c.age i.group

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1366.0718}  
Iteration 1:{space 3}log likelihood = {res:-1111.4595}  
Iteration 2:{space 3}log likelihood = {res: -1069.588}  
Iteration 3:{space 3}log likelihood = {res:     -1068}  
Iteration 4:{space 3}log likelihood = {res:-1067.9941}  
Iteration 5:{space 3}log likelihood = {res:-1067.9941}  
{res}
{txt}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:3,000}
{txt}{col 57}{lalign 13:LR chi2({res:4})}{col 70} = {res}{ralign 6:596.16}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}Log likelihood = {res:-1067.9941}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.2182}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}
{space 5}female  {c |}{col 14}{res}{space 2} .4991622{col 26}{space 2} .1347463{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .2350643{col 67}{space 3}   .76326
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0902429{col 26}{space 2} .0064801{col 37}{space 1}   13.93{col 46}{space 3}0.000{col 54}{space 4} .0775421{col 67}{space 3} .1029437
{txt}{space 12} {c |}
{space 7}group {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.5855242{col 26}{space 2} .1350192{col 37}{space 1}   -4.34{col 46}{space 3}0.000{col 54}{space 4} -.850157{col 67}{space 3}-.3208915
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-1.360208{col 26}{space 2} .2914263{col 37}{space 1}   -4.67{col 46}{space 3}0.000{col 54}{space 4}-1.931393{col 67}{space 3}-.7890228
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-5.553038{col 26}{space 2} .3498204{col 37}{space 1}  -15.87{col 46}{space 3}0.000{col 54}{space 4}-6.238674{col 67}{space 3}-4.867403
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_8
. logit outcome i.sex c.age i.group, or

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1366.0718}  
Iteration 1:{space 3}log likelihood = {res:-1111.4595}  
Iteration 2:{space 3}log likelihood = {res: -1069.588}  
Iteration 3:{space 3}log likelihood = {res:     -1068}  
Iteration 4:{space 3}log likelihood = {res:-1067.9941}  
Iteration 5:{space 3}log likelihood = {res:-1067.9941}  
{res}
{txt}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:3,000}
{txt}{col 57}{lalign 13:LR chi2({res:4})}{col 70} = {res}{ralign 6:596.16}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}Log likelihood = {res:-1067.9941}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.2182}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |} Odds ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}
{space 5}female  {c |}{col 14}{res}{space 2}  1.64734{col 26}{space 2}  .221973{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4}  1.26499{col 67}{space 3} 2.145258
{txt}{space 9}age {c |}{col 14}{res}{space 2}  1.09444{col 26}{space 2} .0070921{col 37}{space 1}   13.93{col 46}{space 3}0.000{col 54}{space 4} 1.080628{col 67}{space 3} 1.108429
{txt}{space 12} {c |}
{space 7}group {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .5568139{col 26}{space 2} .0751806{col 37}{space 1}   -4.34{col 46}{space 3}0.000{col 54}{space 4} .4273478{col 67}{space 3}  .725502
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2566074{col 26}{space 2} .0747822{col 37}{space 1}   -4.67{col 46}{space 3}0.000{col 54}{space 4} .1449462{col 67}{space 3} .4542885
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0038757{col 26}{space 2} .0013558{col 37}{space 1}  -15.87{col 46}{space 3}0.000{col 54}{space 4} .0019524{col 67}{space 3} .0076933
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline odds{txt}.{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-regression-the-basics/logistic-regression-the-basics.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 May 2021, 09:47:01
{txt}{.-}
{smcl}
{txt}{sf}{ul off}