{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\Github\newstuff\categorical\simpsons-paradox-hospital-data\simpsons-paradox-hospital-data.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Sep 2021, 13:29:53
{txt}
{com}. //_1
. display c(current_date)
{res}11 Sep 2021
{txt}
{com}. //_2
. display c(current_time)
{res}13:29:53
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. use "https://github.com/agrogan1/newstuff/blob/master/categorical/simpsons-paradox-hospital-data/hospitaldata.dta?raw=true"
{txt}
{com}. //_5
. list
{txt}
     {c TLC}{hline 10}{c -}{hline 13}{c -}{hline 9}{c -}{hline 7}{c TRC}
     {c |} {res}hospital      severity   outcome   count {txt}{c |}
     {c LT}{hline 10}{c -}{hline 13}{c -}{hline 9}{c -}{hline 7}{c RT}
  1. {c |} {res}  better   less severe   success      18 {txt}{c |}
  2. {c |} {res}  better   less severe   failure       2 {txt}{c |}
  3. {c |} {res}  better   more severe   success      32 {txt}{c |}
  4. {c |} {res}  better   more severe   failure      48 {txt}{c |}
  5. {c |} {res}  normal   less severe   success      64 {txt}{c |}
     {c LT}{hline 10}{c -}{hline 13}{c -}{hline 9}{c -}{hline 7}{c RT}
  6. {c |} {res}  normal   less severe   failure      16 {txt}{c |}
  7. {c |} {res}  normal   more severe   success       4 {txt}{c |}
  8. {c |} {res}  normal   more severe   failure      16 {txt}{c |}
     {c BLC}{hline 10}{c -}{hline 13}{c -}{hline 9}{c -}{hline 7}{c BRC}

{com}. //_6
. tabulate hospital outcome [fweight = count], row 
{txt}
{c TLC}{hline 16}{c TRC}
{c |} Key{col 18}{c |}
{c LT}{hline 16}{c RT}
{c |}{space 3}{it:frequency}{col 18}{c |}
{c |}{space 1}{it:row percentage}{col 18}{c |}
{c BLC}{hline 16}{c BRC}

           {c |}        outcome
  hospital {c |}   failure    success {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    better {c |}{res}        50         50 {txt}{c |}{res}       100 
           {txt}{c |}{res}     50.00      50.00 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
    normal {c |}{res}        32         68 {txt}{c |}{res}       100 
           {txt}{c |}{res}     32.00      68.00 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        82        118 {txt}{c |}{res}       200 
           {txt}{c |}{res}     41.00      59.00 {txt}{c |}{res}    100.00 
{txt}
{com}. //_7
. graph bar (count) [fweight = count], over(outcome) over(hospital) blabel(bar) title("Hospital Outcomes") scheme(michigan)
{res}{txt}
{com}. //_8
. graph export bivariategraph.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
bivariategraph.png{rm}
saved as
PNG
format
{p_end}

{com}. //_9
. generate severity_hospital = severity + " " + hospital // concatenate severity + hospital type
{txt}
{com}. //_10
. tabulate severity_hospital outcome [fweight=count], row 
{txt}
{c TLC}{hline 16}{c TRC}
{c |} Key{col 18}{c |}
{c LT}{hline 16}{c RT}
{c |}{space 3}{it:frequency}{col 18}{c |}
{c |}{space 1}{it:row percentage}{col 18}{c |}
{c BLC}{hline 16}{c BRC}

                   {c |}        outcome
 severity_hospital {c |}   failure    success {c |}     Total
{hline 19}{c +}{hline 22}{c +}{hline 10}
less severe better {c |}{res}         2         18 {txt}{c |}{res}        20 
                   {txt}{c |}{res}     10.00      90.00 {txt}{c |}{res}    100.00 
{txt}{hline 19}{c +}{hline 22}{c +}{hline 10}
less severe normal {c |}{res}        16         64 {txt}{c |}{res}        80 
                   {txt}{c |}{res}     20.00      80.00 {txt}{c |}{res}    100.00 
{txt}{hline 19}{c +}{hline 22}{c +}{hline 10}
more severe better {c |}{res}        48         32 {txt}{c |}{res}        80 
                   {txt}{c |}{res}     60.00      40.00 {txt}{c |}{res}    100.00 
{txt}{hline 19}{c +}{hline 22}{c +}{hline 10}
more severe normal {c |}{res}        16          4 {txt}{c |}{res}        20 
                   {txt}{c |}{res}     80.00      20.00 {txt}{c |}{res}    100.00 
{txt}{hline 19}{c +}{hline 22}{c +}{hline 10}
             Total {c |}{res}        82        118 {txt}{c |}{res}       200 
                   {txt}{c |}{res}     41.00      59.00 {txt}{c |}{res}    100.00 
{txt}
{com}. //_11
. graph bar [fweight = count] if severity == "less severe", ///
> title(Less Severe) ///
> over(outcome) ///
> blabel(bar) ///
> by(hospital) ////
> scheme(michigan) ///
> name(lesssevere, replace)
{res}{txt}
{com}. //_12
. graph bar [fweight = count] if severity == "more severe", ///
> title(More Severe) ///
> over(outcome) ///
> blabel(bar) ///
> by(hospital) ///
> scheme(michigan) ///
> name(moresevere, replace)
{res}{txt}
{com}. //_13
. graph combine lesssevere moresevere, title(Hospital Outcomes) scheme(michigan)
{res}{txt}
{com}. //_14
. graph export multivariategraph.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
multivariategraph.png{rm}
saved as
PNG
format
{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\Github\newstuff\categorical\simpsons-paradox-hospital-data\simpsons-paradox-hospital-data.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 Sep 2021, 13:30:01
{txt}{.-}
{smcl}
{txt}{sf}{ul off}