{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/Bayes/Bayes.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 Nov 2020, 11:02:13
{txt}
{com}. //_1
. display c(current_date)
{res}27 Nov 2020
{txt}
{com}. //_2
. display c(current_time)
{res}11:02:13
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. clear all
{res}{txt}
{com}. //_5
. set seed 1234 // setting random seed is important!!!
{txt}
{com}. //_6
. use "../logistic-regression/GSSsmall.dta", clear
{txt}
{com}. //_7
. logit liberal i.race i.class

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-31538.733}  
Iteration 1:{space 3}log likelihood = {res:-31370.507}  
Iteration 2:{space 3}log likelihood = {res:-31369.841}  
Iteration 3:{space 3}log likelihood = {res:-31369.841}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    53,625
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}    337.78
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-31369.841{txt}{col 49}Pseudo R2{col 67}= {res}    0.0054

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       liberal{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      z{col 48}   P>|z|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}race {c |}
{space 8}black  {c |}{col 16}{res}{space 2} .4443531{col 28}{space 2} .0272062{col 39}{space 1}   16.33{col 48}{space 3}0.000{col 56}{space 4}   .39103{col 69}{space 3} .4976762
{txt}{space 8}other  {c |}{col 16}{res}{space 2} .3190896{col 28}{space 2} .0413275{col 39}{space 1}    7.72{col 48}{space 3}0.000{col 56}{space 4} .2380891{col 69}{space 3} .4000901
{txt}{space 14} {c |}
{space 9}class {c |}
working class  {c |}{col 16}{res}{space 2}-.1397848{col 28}{space 2}  .041515{col 39}{space 1}   -3.37{col 48}{space 3}0.001{col 56}{space 4}-.2211527{col 69}{space 3}-.0584169
{txt}{space 1}middle class  {c |}{col 16}{res}{space 2}-.0117948{col 28}{space 2} .0416509{col 39}{space 1}   -0.28{col 48}{space 3}0.777{col 56}{space 4} -.093429{col 69}{space 3} .0698394
{txt}{space 2}upper class  {c |}{col 16}{res}{space 2} .1512565{col 28}{space 2} .0648962{col 39}{space 1}    2.33{col 48}{space 3}0.020{col 56}{space 4} .0240624{col 69}{space 3} .2784507
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.9900441{col 28}{space 2} .0397384{col 39}{space 1}  -24.91{col 48}{space 3}0.000{col 56}{space 4} -1.06793{col 69}{space 3}-.9121582
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_8
. sample 10 // Random Sample To Speed This Example: DON'T DO THIS IN PRACTICE!!!
{txt}(58,332 observations deleted)

{com}. //_9
. bayes: logit liberal i.race i.class
{res}  
{txt}Burn-in ...
{txt}Simulation ...
{res}
{txt}Model summary
{txt}{hline 80}
{txt}Likelihood: 
{p 0 12}{space 2}{res:liberal} ~ logit(xb_liberal){p_end}

Prior: 
{p 0 35}{space 2}{res}{c -(}liberal:i.race i.class _cons{c )-}{txt} ~ normal(0,10000){space 27}(1){p_end}
{txt}{hline 80}
{p 0 4 0 80}
(1) Parameters are elements of the linear form xb_liberal.
{p_end}

{res}{txt}Bayesian logistic regression{col 52}MCMC iterations{col 69}={col 71}{res}    12,500
{txt}Random-walk Metropolis-Hastings sampling{col 52}Burn-in{col 69}={col 71}{res}     2,500
{col 52}{txt}MCMC sample size{col 69}={col 71}{res}    10,000
{txt}{col 52}Number of obs{col 69}={col 71}{res}     5,376
{txt}{col 52}Acceptance rate{col 69}={col 71}{res}     .2312
{txt}{col 52}Efficiency:{col 65}min ={col 71}{res}    .01541
{col 65}{txt}avg ={col 71}{res}    .03017
{txt}Log marginal likelihood = {res}-3193.2465{col 65}{txt}max ={col 71}{res}    .05577
 
{txt}{hline 15}{col 16}{c TT}{hline 64}
{col 16}{c |}{col 65}Equal-tailed
{col 8}liberal{col 16}{c |}{col 23}Mean{col 30}Std. Dev.{col 44}MCSE{col 53}Median{col 61}[95% Cred. Interval]
{res}{txt}{hline 15}{c +}{hline 10}{hline 11}{hline 10}{hline 11}{hline 11}{hline 11}
{space 10}race {c |}
{space 8}black  {c |}{col 16}{res}{space 1} .5186618{col 27}{space 2} .0888498{col 38}{space 2} .005436{col 48}{space 2} .5162073{col 59}{space 2} .3446927{col 70}{space 2} .6905559
{txt}{space 8}other  {c |}{col 16}{res}{space 1} .3315087{col 27}{space 2} .1318099{col 38}{space 2} .006538{col 48}{space 2} .3340969{col 59}{space 2} .0778656{col 70}{space 2} .5812581
{txt}{space 14} {c |}
{space 9}class {c |}
working class  {c |}{col 16}{res}{space 1}-.2257059{col 27}{space 2} .1359429{col 38}{space 2}  .01095{col 48}{space 2}-.2304211{col 59}{space 2}-.4719162{col 70}{space 2} .0560403
{txt}{space 1}middle class  {c |}{col 16}{res}{space 1}-.2159555{col 27}{space 2} .1280385{col 38}{space 2} .008659{col 48}{space 2}-.2177452{col 59}{space 2}-.4572864{col 70}{space 2} .0353198
{txt}{space 2}upper class  {c |}{col 16}{res}{space 1} .1385091{col 27}{space 2} .2119785{col 38}{space 2} .008976{col 48}{space 2} .1421824{col 59}{space 2}-.2664372{col 70}{space 2} .5469788
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 1}-.8561818{col 27}{space 2} .1277022{col 38}{space 2} .008896{col 48}{space 2}-.8537522{col 59}{space 2}-1.104622{col 70}{space 2}-.6151415
{txt}{hline 15}{c BT}{hline 10}{hline 11}{hline 10}{hline 11}{hline 11}{hline 11}
{p 0 6 2}Note: {help j_bayes_defaultpriors:Default priors} are used for model parameters.{p_end}
{res}{txt}
{com}. //_10
. * bayes, block({c -(}liberal:i.race{c )-}): logit liberal i.race i.class // blocking may improve estimation
. //_11
. bayes, normalprior(5): logit liberal i.race i.class
{res}  
{txt}Burn-in ...
{txt}Simulation ...
{res}
{txt}Model summary
{txt}{hline 80}
{txt}Likelihood: 
{p 0 12}{space 2}{res:liberal} ~ logit(xb_liberal){p_end}

Prior: 
{p 0 35}{space 2}{res}{c -(}liberal:i.race i.class _cons{c )-}{txt} ~ normal(0,25){space 30}(1){p_end}
{txt}{hline 80}
{p 0 4 0 80}
(1) Parameters are elements of the linear form xb_liberal.
{p_end}

{res}{txt}Bayesian logistic regression{col 52}MCMC iterations{col 69}={col 71}{res}    12,500
{txt}Random-walk Metropolis-Hastings sampling{col 52}Burn-in{col 69}={col 71}{res}     2,500
{col 52}{txt}MCMC sample size{col 69}={col 71}{res}    10,000
{txt}{col 52}Number of obs{col 69}={col 71}{res}     5,376
{txt}{col 52}Acceptance rate{col 69}={col 71}{res}     .2296
{txt}{col 52}Efficiency:{col 65}min ={col 71}{res}    .02373
{col 65}{txt}avg ={col 71}{res}    .03808
{txt}Log marginal likelihood = {res}-3175.5153{col 65}{txt}max ={col 71}{res}    .05215
 
{txt}{hline 15}{col 16}{c TT}{hline 64}
{col 16}{c |}{col 65}Equal-tailed
{col 8}liberal{col 16}{c |}{col 23}Mean{col 30}Std. Dev.{col 44}MCSE{col 53}Median{col 61}[95% Cred. Interval]
{res}{txt}{hline 15}{c +}{hline 10}{hline 11}{hline 10}{hline 11}{hline 11}{hline 11}
{space 10}race {c |}
{space 8}black  {c |}{col 16}{res}{space 1} .5156108{col 27}{space 2} .0846052{col 38}{space 2} .003705{col 48}{space 2} .5165275{col 59}{space 2} .3428716{col 70}{space 2} .6703037
{txt}{space 8}other  {c |}{col 16}{res}{space 1} .3494915{col 27}{space 2} .1292596{col 38}{space 2} .007216{col 48}{space 2} .3517041{col 59}{space 2} .0891921{col 70}{space 2} .6044571
{txt}{space 14} {c |}
{space 9}class {c |}
working class  {c |}{col 16}{res}{space 1}-.2177134{col 27}{space 2} .1271378{col 38}{space 2} .005941{col 48}{space 2}-.2191734{col 59}{space 2}-.4736636{col 70}{space 2} .0299706
{txt}{space 1}middle class  {c |}{col 16}{res}{space 1}-.2111361{col 27}{space 2} .1279262{col 38}{space 2} .006815{col 48}{space 2} -.209842{col 59}{space 2}-.4649101{col 70}{space 2} .0467745
{txt}{space 2}upper class  {c |}{col 16}{res}{space 1} .1408649{col 27}{space 2} .2085374{col 38}{space 2} .013539{col 48}{space 2} .1413301{col 59}{space 2}-.2595456{col 70}{space 2} .5542024
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 1}-.8599554{col 27}{space 2} .1222741{col 38}{space 2} .006154{col 48}{space 2}-.8616087{col 59}{space 2}-1.102605{col 70}{space 2} -.620957
{txt}{hline 15}{c BT}{hline 10}{hline 11}{hline 10}{hline 11}{hline 11}{hline 11}
{p 0 6 2}Note: {help j_bayes_defaultpriors:Default priors} are used for model parameters.{p_end}
{res}{txt}
{com}. //_12
. clear all
{res}{txt}
{com}. //_13
. set obs 100
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. //_14
. generate myestimate = rnormal() + 10 // simulated values of estimate
{txt}
{com}. //_15
. summarize myestimate

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}myestimate {c |}{res}        100     9.94191    .9294447   7.932717   12.31949
{txt}
{com}. //_16
. local mymean = r(mean)
{txt}
{com}. //_17
. kdensity myestimate ,  ///
> title("Likelihood of Estimate") ///
> xtitle("Estimate") ytitle("Likelihood") ///
> note("Vertical Line At Mean Value") ///
> caption("ML gives point estimate; Bayes gives full range of distribution") ///
> xline(`mymean', lwidth(1) lcolor(gold)) scheme(michigan)
{res}{txt}
{com}. //_18
. graph export MCMC-ML.png, width(500) replace
{txt}(file MCMC-ML.png written in PNG format)

{com}. //_19
. clear all
{res}{txt}
{com}. //_20
. use "../logistic-regression/GSSsmall.dta", clear
{txt}
{com}. //_21
. sample 10 // Random Sample for These Slides: DON'T DO THIS IN PRACTICE!!!
{txt}(58,332 observations deleted)

{com}. //_22
. bayes, normalprior(5): logit liberal i.race i.class
{res}  
{txt}Burn-in ...
{txt}Simulation ...
{res}
{txt}Model summary
{txt}{hline 80}
{txt}Likelihood: 
{p 0 12}{space 2}{res:liberal} ~ logit(xb_liberal){p_end}

Prior: 
{p 0 35}{space 2}{res}{c -(}liberal:i.race i.class _cons{c )-}{txt} ~ normal(0,25){space 30}(1){p_end}
{txt}{hline 80}
{p 0 4 0 80}
(1) Parameters are elements of the linear form xb_liberal.
{p_end}

{res}{txt}Bayesian logistic regression{col 52}MCMC iterations{col 69}={col 71}{res}    12,500
{txt}Random-walk Metropolis-Hastings sampling{col 52}Burn-in{col 69}={col 71}{res}     2,500
{col 52}{txt}MCMC sample size{col 69}={col 71}{res}    10,000
{txt}{col 52}Number of obs{col 69}={col 71}{res}     5,383
{txt}{col 52}Acceptance rate{col 69}={col 71}{res}     .2236
{txt}{col 52}Efficiency:{col 65}min ={col 71}{res}    .02256
{col 65}{txt}avg ={col 71}{res}    .03414
{txt}Log marginal likelihood = {res}-3177.2034{col 65}{txt}max ={col 71}{res}    .05443
 
{txt}{hline 15}{col 16}{c TT}{hline 64}
{col 16}{c |}{col 65}Equal-tailed
{col 8}liberal{col 16}{c |}{col 23}Mean{col 30}Std. Dev.{col 44}MCSE{col 53}Median{col 61}[95% Cred. Interval]
{res}{txt}{hline 15}{c +}{hline 10}{hline 11}{hline 10}{hline 11}{hline 11}{hline 11}
{space 10}race {c |}
{space 8}black  {c |}{col 16}{res}{space 1} .4851672{col 27}{space 2} .0829121{col 38}{space 2} .004159{col 48}{space 2} .4879013{col 59}{space 2} .3172142{col 70}{space 2} .6439872
{txt}{space 8}other  {c |}{col 16}{res}{space 1} .0424599{col 27}{space 2}  .135287{col 38}{space 2} .005799{col 48}{space 2} .0432961{col 59}{space 2} -.223915{col 70}{space 2} .3134179
{txt}{space 14} {c |}
{space 9}class {c |}
working class  {c |}{col 16}{res}{space 1}-.3129757{col 27}{space 2} .1321655{col 38}{space 2}   .0088{col 48}{space 2}-.3171116{col 59}{space 2}-.5767932{col 70}{space 2}-.0470307
{txt}{space 1}middle class  {c |}{col 16}{res}{space 1}-.2267685{col 27}{space 2} .1281627{col 38}{space 2} .008449{col 48}{space 2}-.2287587{col 59}{space 2}-.4673167{col 70}{space 2} .0249752
{txt}{space 2}upper class  {c |}{col 16}{res}{space 1}-.1154092{col 27}{space 2} .2013339{col 38}{space 2} .010816{col 48}{space 2}-.1178767{col 59}{space 2}-.5131633{col 70}{space 2} .2788442
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 1}-.7892161{col 27}{space 2} .1229919{col 38}{space 2} .007051{col 48}{space 2}-.7913504{col 59}{space 2}-1.037607{col 70}{space 2}-.5534833
{txt}{hline 15}{c BT}{hline 10}{hline 11}{hline 10}{hline 11}{hline 11}{hline 11}
{p 0 6 2}Note: {help j_bayes_defaultpriors:Default priors} are used for model parameters.{p_end}
{res}{txt}
{com}. //_23
. bayesgraph kdensity {c -(}liberal:2.race{c )-}, scheme(michigan)
{res}{txt}
{com}. //_24
. graph export mybayesgraph.png, width(500) replace
{txt}(file mybayesgraph.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/Bayes/Bayes.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}27 Nov 2020, 11:03:24
{txt}{.-}
{smcl}
{txt}{sf}{ul off}