{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\Github\newstuff\categorical\count-regression\count-regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Oct 2021, 13:47:28
{txt}
{com}. //_1
. display c(current_date)
{res}16 Oct 2021
{txt}
{com}. //_2
. clear all // clear all for simulated data
{res}{txt}
{com}. //_3
. set obs 1000 // number of observations
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 1,000.
{p_end}

{com}. //_4
. generate x = rnormal() // normally distributed random variable
{txt}
{com}. //_5
. histogram x, title("Normally Distributed Random Variable") scheme(michigan)
{txt}(bin={res}29{txt}, start={res}-2.7213843{txt}, width={res}.21384327{txt})
{res}{txt}
{com}. //_6
. graph export myhistogram.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
myhistogram.png{rm}
saved as
PNG
format
{p_end}

{com}. //_7
. generate w = rpoisson(.5)
{txt}
{com}. //_8
. histogram w, title("Poisson Distributed Random Variable") scheme(michigan)
{txt}(bin={res}29{txt}, start={res}0{txt}, width={res}.10344828{txt})
{res}{txt}
{com}. //_9
. graph export myhistogram2.png, width(500) replace
{txt}{p 0 4 2}
file {bf}
myhistogram2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_10
. clear all
{res}{txt}
{com}. //_11
. set obs 20
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 20.
{p_end}

{com}. //_12
. generate field = _n // field number
{txt}
{com}. //_13
. generate mycount = rpoisson(1)
{txt}
{com}. //_14
. expand mycount // create individual observations
{txt}(8 zero counts ignored; observations not deleted)
(13 observations created)

{com}. //_15
. generate x = runiform(1,10) // random x coordinate
{txt}
{com}. //_16
. generate y =runiform(1,10) // random y coordinate
{txt}
{com}. //_17
. generate mylabel = "ðŸ¦†"
{txt}
{com}. //_18
. twoway scatter y x, ///
> by(field, title("Randomly Located Ducks")) ///
> mlab(mylabel) mlabsize(vlarge) ///
> msymbol(none)  ///
> legend(order(1 "ðŸ¦† Duck")) ///
> scheme(michigan) plotr(fcolor(olive_teal))
{res}{txt}
{com}. //_19
. graph export ducks.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
ducks.png{rm}
saved as
PNG
format
{p_end}

{com}. //_20
. generate t = runiform(1,10) // random time coordinate
{txt}
{com}. //_21
. generate y2 = runiform(1,2) // random y coordinate
{txt}
{com}. //_22
. generate mylabel2 = "ðŸ”¥"
{txt}
{com}. //_23
. generate timeperiod = field
{txt}
{com}. //_24
. twoway scatter y2 t, ///
> by(timeperiod, title("Forest Fires At Random Times", size(vhuge)) cols(10)) ///
> ytitle("", size(zero)) ylabel(none) xtitle("", size(zero)) xlabel(none) ///
> subtitle(, size(vhuge)) ///
> mlab(mylabel2) mlabsize(vhuge) ///
> msymbol(none)  ///
> legend(order(1 "ðŸ”¥ Forest Fire")) ///
> scheme(michigan) plotr(fcolor(gs14)) ///
> xsize(5) ysize(1)
{res}{txt}
{com}. //_25
. graph export fires.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
fires.png{rm}
saved as
PNG
format
{p_end}

{com}. //_26
. clear all
{res}{txt}
{com}. //_27
. use "../predict-and-margins-substantive-example/NSCH_ACES.dta", clear
{txt}
{com}. //_28
. describe

{txt}Contains data from {res}../predict-and-margins-substantive-example/NSCH_ACES.dta
{txt} Observations:{res}        30,530                  
{txt}    Variables:{res}            23                  20 Oct 2020 14:50
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:sc_sex         }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{txt}sc_sex_lab{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Sex of Selected Child{p_end}
{p 0 48}{bind:ace3           }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{bind:ace3_lab }{bind:  }{res}{res}Child Experienced - Parent or Guardian Divorced{p_end}
{p 0 48}{bind:ace4           }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{bind:ace4_lab }{bind:  }{res}{res}Child Experienced - Parent or Guardian Died{p_end}
{p 0 48}{bind:ace5           }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{bind:ace5_lab }{bind:  }{res}{res}Child Experienced - Parent or Guardian Time in Jail{p_end}
{p 0 48}{bind:ace6           }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{bind:ace6_lab }{bind:  }{res}{res}Child Experienced - Adults Slap, Hit, Kick, Punch Others{p_end}
{p 0 48}{bind:ace7           }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{bind:ace7_lab }{bind:  }{res}{res}Child Experienced - Victim of Violence{p_end}
{p 0 48}{bind:ace8           }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{bind:ace8_lab }{bind:  }{res}{res}Child Experienced - Lived with Mentally Ill{p_end}
{p 0 48}{bind:ace9           }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{bind:ace9_lab }{bind:  }{res}{res}Child Experienced - Lived with Person with Alcohol/Drug Problem{p_end}
{p 0 48}{bind:ace10          }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{txt}ace10_lab{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Child Experienced - Treated Unfairly Because of Race{p_end}
{p 0 48}{bind:ace1           }{txt}{bind: byte    }{bind:{txt}%30.0g    }{space 1}{bind:ace1_lab }{bind:  }{res}{res}Hard to Cover Basics Like Food or Housing{p_end}
{p 0 48}{bind:sc_race_r      }{txt}{bind: byte    }{bind:{txt}%48.0g    }{space 1}{txt}sc_race_r_lab{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Race of Selected Child, Detailed{p_end}
{p 0 48}{bind:sc_racer       }{txt}{bind: byte    }{bind:{txt}%31.0g    }{space 1}{txt}sc_racer_lab{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Race of Selected Child, Recode{p_end}
{p 0 48}{bind:higrade        }{txt}{bind: byte    }{bind:{txt}%61.0g    }{space 1}{txt}higrade_lab{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Highest Level of Education among Reported Adults{p_end}
{p 0 48}{bind:depress        }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of k2q32b (Depression Currently){p_end}
{p 0 48}{bind:ace1R          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace1 (Hard to Cover Basics Like Food or Housing){p_end}
{p 0 48}{bind:ace3R          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace3 (Child Experienced - Parent or Guardian Divorced){p_end}
{p 0 48}{bind:ace4R          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace4 (Child Experienced - Parent or Guardian Died){p_end}
{p 0 48}{bind:ace5R          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace5 (Child Experienced - Parent or Guardian Time in Jail){p_end}
{p 0 48}{bind:ace6R          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace6 (Child Experienced - Adults Slap, Hit, Kick, Punch Others){p_end}
{p 0 48}{bind:ace7R          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace7 (Child Experienced - Victim of Violence){p_end}
{p 0 48}{bind:ace8R          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace8 (Child Experienced - Lived with Mentally Ill){p_end}
{p 0 48}{bind:ace9R          }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace9 (Child Experienced - Lived with Person with Alcohol/Drug Problem){p_end}
{p 0 48}{bind:ace10R         }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}RECODE of ace10 (Child Experienced - Treated Unfairly Because of Race){p_end}
{txt}{hline}
Sorted by: 

{com}. //_29
. egen acecount = anycount(ace*R), values(1) // generate count of ACES
{txt}
{com}. //_30
. histogram acecount, discrete scheme(michigan)
{txt}(start={res}0{txt}, width={res}1{txt})
{res}{txt}
{com}. //_31
. graph export myhistogram3.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
myhistogram3.png{rm}
saved as
PNG
format
{p_end}

{com}. //_32
. poisson acecount sc_sex i.sc_race_r i.higrade
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-44759.253}  
Iteration 1:{space 3}log likelihood = {res:-44758.999}  
Iteration 2:{space 3}log likelihood = {res:-44758.999}  
{res}
{txt}Poisson regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:30,530}
{txt}{col 56}{lalign 13:LR chi2({res:9})}{col 69} = {res}{ralign 7:2054.20}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}Log likelihood = {res:-44758.999}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0224}

{txt}{hline 63}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                                                      acecount{col 64}{c |} Coefficient{col 76}  Std. err.{col 88}      z{col 96}   P>|z|{col 104}     [95% con{col 117}f. interval]
{hline 63}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 56}sc_sex {c |}{col 64}{res}{space 2} -.012823{col 76}{space 2} .0111291{col 87}{space 1}   -1.15{col 96}{space 3}0.249{col 104}{space 4}-.0346357{col 117}{space 3} .0089897
{txt}{space 62} {c |}
{space 53}sc_race_r {c |}
{space 30}Black or African American alone  {c |}{col 64}{res}{space 2} .2662761{col 76}{space 2} .0196921{col 87}{space 1}   13.52{col 96}{space 3}0.000{col 104}{space 4} .2276802{col 117}{space 3} .3048719
{txt}{space 23}American Indian or Alaska Native alone  {c |}{col 64}{res}{space 2} .5971063{col 76}{space 2} .0447201{col 87}{space 1}   13.35{col 96}{space 3}0.000{col 104}{space 4} .5094566{col 117}{space 3}  .684756
{txt}{space 50}Asian alone  {c |}{col 64}{res}{space 2}-.6243821{col 76}{space 2} .0358521{col 87}{space 1}  -17.42{col 96}{space 3}0.000{col 104}{space 4}-.6946509{col 117}{space 3}-.5541134
{txt}{space 13}Native Hawaiian and Other Pacific Islander alone  {c |}{col 64}{res}{space 2} .2067409{col 76}{space 2} .0969415{col 87}{space 1}    2.13{col 96}{space 3}0.033{col 104}{space 4} .0167392{col 117}{space 3} .3967427
{txt}{space 40}Some Other Race alone  {c |}{col 64}{res}{space 2} .0675521{col 76}{space 2} .0324881{col 87}{space 1}    2.08{col 96}{space 3}0.038{col 104}{space 4} .0038765{col 117}{space 3} .1312277
{txt}{space 44}Two or More Races  {c |}{col 64}{res}{space 2} .2818125{col 76}{space 2} .0190548{col 87}{space 1}   14.79{col 96}{space 3}0.000{col 104}{space 4} .2444658{col 117}{space 3} .3191593
{txt}{space 62} {c |}
{space 55}higrade {c |}
High school (including vocational, trade, or business school)  {c |}{col 64}{res}{space 2} .0632486{col 76}{space 2} .0322397{col 87}{space 1}    1.96{col 96}{space 3}0.050{col 104}{space 4}   .00006{col 117}{space 3} .1264372
{txt}{space 40}More than high school  {c |}{col 64}{res}{space 2}-.3786108{col 76}{space 2}  .030587{col 87}{space 1}  -12.38{col 96}{space 3}0.000{col 104}{space 4}-.4385602{col 117}{space 3}-.3186615
{txt}{space 62} {c |}
{space 57}_cons {c |}{col 64}{res}{space 2} .3399425{col 76}{space 2} .0345283{col 87}{space 1}    9.85{col 96}{space 3}0.000{col 104}{space 4} .2722683{col 117}{space 3} .4076166
{txt}{hline 63}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_33
. poisson, irr

{txt}Poisson regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:30,530}
{txt}{col 56}{lalign 13:LR chi2({res:9})}{col 69} = {res}{ralign 7:2054.20}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}Log likelihood = {res:-44758.999}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0224}

{txt}{hline 63}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                                                      acecount{col 64}{c |}        IRR{col 76}   Std. err.{col 88}      z{col 96}   P>|z|{col 104}     [95% con{col 117}f. interval]
{hline 63}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 56}sc_sex {c |}{col 64}{res}{space 2} .9872589{col 76}{space 2} .0109873{col 87}{space 1}   -1.15{col 96}{space 3}0.249{col 104}{space 4} .9659573{col 117}{space 3}  1.00903
{txt}{space 62} {c |}
{space 53}sc_race_r {c |}
{space 30}Black or African American alone  {c |}{col 64}{res}{space 2} 1.305095{col 76}{space 2} .0257001{col 87}{space 1}   13.52{col 96}{space 3}0.000{col 104}{space 4} 1.255684{col 117}{space 3} 1.356451
{txt}{space 23}American Indian or Alaska Native alone  {c |}{col 64}{res}{space 2} 1.816854{col 76}{space 2} .0812498{col 87}{space 1}   13.35{col 96}{space 3}0.000{col 104}{space 4} 1.664386{col 117}{space 3} 1.983288
{txt}{space 50}Asian alone  {c |}{col 64}{res}{space 2} .5355922{col 76}{space 2} .0192021{col 87}{space 1}  -17.42{col 96}{space 3}0.000{col 104}{space 4} .4992487{col 117}{space 3} .5745815
{txt}{space 13}Native Hawaiian and Other Pacific Islander alone  {c |}{col 64}{res}{space 2} 1.229664{col 76}{space 2} .1192054{col 87}{space 1}    2.13{col 96}{space 3}0.033{col 104}{space 4}  1.01688{col 117}{space 3} 1.486973
{txt}{space 40}Some Other Race alone  {c |}{col 64}{res}{space 2} 1.069886{col 76}{space 2} .0347586{col 87}{space 1}    2.08{col 96}{space 3}0.038{col 104}{space 4} 1.003884{col 117}{space 3} 1.140227
{txt}{space 44}Two or More Races  {c |}{col 64}{res}{space 2}  1.32553{col 76}{space 2} .0252577{col 87}{space 1}   14.79{col 96}{space 3}0.000{col 104}{space 4} 1.276939{col 117}{space 3}  1.37597
{txt}{space 62} {c |}
{space 55}higrade {c |}
High school (including vocational, trade, or business school)  {c |}{col 64}{res}{space 2} 1.065292{col 76}{space 2} .0343446{col 87}{space 1}    1.96{col 96}{space 3}0.050{col 104}{space 4}  1.00006{col 117}{space 3} 1.134778
{txt}{space 40}More than high school  {c |}{col 64}{res}{space 2} .6848121{col 76}{space 2} .0209463{col 87}{space 1}  -12.38{col 96}{space 3}0.000{col 104}{space 4} .6449644{col 117}{space 3} .7271216
{txt}{space 62} {c |}
{space 57}_cons {c |}{col 64}{res}{space 2} 1.404867{col 76}{space 2} .0485076{col 87}{space 1}    9.85{col 96}{space 3}0.000{col 104}{space 4} 1.312939{col 117}{space 3} 1.503231
{txt}{hline 63}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {bf:_cons} estimates baseline incidence rate{txt}.{p_end}

{com}. //_34
. nbreg acecount sc_sex i.sc_race_r i.higrade, irr

{txt}Fitting Poisson model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-44759.253}  
Iteration 1:{space 3}log likelihood = {res:-44758.999}  
Iteration 2:{space 3}log likelihood = {res:-44758.999}  
{res}
{txt}Fitting constant-only model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:  -43591.3}  
Iteration 1:{space 3}log likelihood = {res:-43392.427}  
Iteration 2:{space 3}log likelihood = {res:-43391.748}  
Iteration 3:{space 3}log likelihood = {res:-43391.748}  
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-42801.127}  
Iteration 1:{space 3}log likelihood = {res:-42775.936}  
Iteration 2:{space 3}log likelihood = {res:-42775.864}  
Iteration 3:{space 3}log likelihood = {res:-42775.864}  
{res}
{txt}Negative binomial regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:30,530}
{txt}{col 56}{lalign 13:LR chi2({res:9})}{col 69} = {res}{ralign 7:1231.77}
{txt}{col 1}Dispersion: {res:mean}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}Log likelihood = {res:-42775.864}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0142}

{txt}{hline 63}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                                                      acecount{col 64}{c |}        IRR{col 76}   Std. err.{col 88}      z{col 96}   P>|z|{col 104}     [95% con{col 117}f. interval]
{hline 63}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 56}sc_sex {c |}{col 64}{res}{space 2} .9873253{col 76}{space 2} .0140708{col 87}{space 1}   -0.90{col 96}{space 3}0.371{col 104}{space 4} .9601287{col 117}{space 3} 1.015292
{txt}{space 62} {c |}
{space 53}sc_race_r {c |}
{space 30}Black or African American alone  {c |}{col 64}{res}{space 2} 1.326253{col 76}{space 2} .0350126{col 87}{space 1}   10.70{col 96}{space 3}0.000{col 104}{space 4} 1.259374{col 117}{space 3} 1.396682
{txt}{space 23}American Indian or Alaska Native alone  {c |}{col 64}{res}{space 2} 1.864104{col 76}{space 2} .1222717{col 87}{space 1}    9.49{col 96}{space 3}0.000{col 104}{space 4} 1.639221{col 117}{space 3} 2.119839
{txt}{space 50}Asian alone  {c |}{col 64}{res}{space 2} .5378757{col 76}{space 2} .0222161{col 87}{space 1}  -15.01{col 96}{space 3}0.000{col 104}{space 4} .4960489{col 117}{space 3} .5832294
{txt}{space 13}Native Hawaiian and Other Pacific Islander alone  {c |}{col 64}{res}{space 2} 1.244574{col 76}{space 2} .1624972{col 87}{space 1}    1.68{col 96}{space 3}0.094{col 104}{space 4} .9635716{col 117}{space 3} 1.607524
{txt}{space 40}Some Other Race alone  {c |}{col 64}{res}{space 2} 1.083969{col 76}{space 2} .0459946{col 87}{space 1}    1.90{col 96}{space 3}0.057{col 104}{space 4} .9974679{col 117}{space 3} 1.177971
{txt}{space 44}Two or More Races  {c |}{col 64}{res}{space 2} 1.325755{col 76}{space 2} .0336113{col 87}{space 1}   11.12{col 96}{space 3}0.000{col 104}{space 4} 1.261488{col 117}{space 3} 1.393296
{txt}{space 62} {c |}
{space 55}higrade {c |}
High school (including vocational, trade, or business school)  {c |}{col 64}{res}{space 2}  1.06806{col 76}{space 2} .0468996{col 87}{space 1}    1.50{col 96}{space 3}0.134{col 104}{space 4}  .979983{col 117}{space 3} 1.164053
{txt}{space 40}More than high school  {c |}{col 64}{res}{space 2} .6831897{col 76}{space 2} .0282212{col 87}{space 1}   -9.22{col 96}{space 3}0.000{col 104}{space 4} .6300572{col 117}{space 3}  .740803
{txt}{space 62} {c |}
{space 57}_cons {c |}{col 64}{res}{space 2} 1.403757{col 76}{space 2} .0647737{col 87}{space 1}    7.35{col 96}{space 3}0.000{col 104}{space 4} 1.282374{col 117}{space 3} 1.536629
{txt}{hline 63}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 54}/lnalpha {c |}{col 64}{res}{space 2}-.5443067{col 76}{space 2} .0239625{col 104}{space 4}-.5912723{col 117}{space 3}-.4973411
{txt}{hline 63}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                                                         alpha {c |}{col 64}{res}{space 2} .5802439{col 76}{space 2} .0139041{col 104}{space 4} .5536224{col 117}{space 3} .6081455
{txt}{hline 63}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation to incidence-rate ratios.{p_end}
{p 0 6 2}Note: {bf:_cons} estimates baseline incidence rate{txt}.{p_end}
LR test of alpha=0: {help j_chibar##|_new:chibar2(01) = }{res}3966.27{col 56}{txt}Prob >= chibar2 = {res}0.000
{txt}
{com}. //_35
. predict yhat
{txt}(option {bf:n} assumed; predicted number of events)

{com}. //_36
. histogram yhat, scheme(michigan) 
{txt}(bin={res}44{txt}, start={res}.50284678{txt}, width={res}.05128577{txt})
{res}{txt}
{com}. //_37
. graph export myyhats.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
myyhats.png{rm}
saved as
PNG
format
{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\Github\newstuff\categorical\count-regression\count-regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Oct 2021, 13:47:48
{txt}{.-}
{smcl}
{txt}{sf}{ul off}