{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/multilevel/multilevel.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Feb 2021, 14:50:38
{txt}
{com}. //_1
. display c(current_date)
{res} 9 Feb 2021
{txt}
{com}. //_2
. display c(current_time)
{res}14:50:38
{txt}
{com}. //_3
. use hsb.dta, clear
{txt}
{com}. //_4
. describe

{txt}Contains data from {res}hsb.dta
{txt}  obs:{res}         7,185                          
{txt} vars:{res}             7                          27 Oct 2020 21:35
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:female         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}female{p_end}
{p 0 48}{bind:ses            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}socioeconomic status{p_end}
{p 0 48}{bind:mathach        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}math achievement{p_end}
{p 0 48}{bind:size           }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}school size{p_end}
{p 0 48}{bind:sector         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Catholic vs. Public{p_end}
{p 0 48}{bind:schoolid       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}School ID{p_end}
{p 0 48}{bind:mathgroup      }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}math group (Hi / Lo){p_end}
{txt}{hline}
Sorted by: 

{com}. //_5
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}female {c |}{res}      7,185    .5281837    .4992398          0          1
{txt}{space 9}ses {c |}{res}      7,185    .0001434    .7793552     -3.758      2.692
{txt}{space 5}mathach {c |}{res}      7,185    12.74785    6.878246     -2.832     24.993
{txt}{space 8}size {c |}{res}      7,185    1056.862    604.1725        100       2713
{txt}{space 6}sector {c |}{res}      7,185    .4931106    .4999873          0          1
{txt}{hline 13}{c +}{hline 57}
{space 4}schoolid {c |}{res}      7,185    5277.898    2499.578       1224       9586
{txt}{space 3}mathgroup {c |}{res}      7,185    .5000696    .5000348          0          1
{txt}
{com}. //_6
. histogram ses, scheme(michigan)
{txt}(bin={res}38{txt}, start={res}-3.7579999{txt}, width={res}.16973684{txt})
{res}{txt}
{com}. //_7
. graph export myhistogram.png, width(1000) replace
{txt}(file /Users/agrogan/Desktop/newstuff/categorical/multilevel/myhistogram.png written in PNG format)

{com}. //_8
. bysort schoolid: egen meanses = mean(ses) // generate mean ses per school
{txt}
{com}. //_9
. summarize ses meanses

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}ses {c |}{res}      7,185    .0001434    .7793552     -3.758      2.692
{txt}{space 5}meanses {c |}{res}      7,185    .0001434    .4135432  -1.193946   .8249825
{txt}
{com}. //_10
. twoway scatter ses meanses, msize(vsmall) ///
> title("SES and Mean SES Are Correlated") sub("But Not Equivalent") ///
> scheme(michigan)
{res}{txt}
{com}. //_11
. graph export myscatter.png, width(1000) replace
{txt}(file /Users/agrogan/Desktop/newstuff/categorical/multilevel/myscatter.png written in PNG format)

{com}. //_12
. melogit mathgroup female ses meanses size sector || schoolid:
{res}{txt}
Fitting fixed-effects model:

Iteration 0:{space 3}log likelihood = {res:-4510.2199}  
Iteration 1:{space 3}log likelihood = {res:-4507.2385}  
Iteration 2:{space 3}log likelihood = {res:-4507.2365}  
Iteration 3:{space 3}log likelihood = {res:-4507.2365}  

Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-4500.0458}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-4500.0458}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-4464.0398}  
Iteration 2:{space 3}log likelihood = {res:-4456.1438}  
Iteration 3:{space 3}log likelihood = {res:-4455.9091}  
Iteration 4:{space 3}log likelihood = {res:-4455.9081}  
Iteration 5:{space 3}log likelihood = {res:-4455.9081}  
{res}
{txt}Mixed-effects logistic regression{col 49}{txt}Number of obs{col 67}={res}{col 69}     7,185
{txt}Group variable: {col 24}{res}schoolid{col 49}{txt}Number of groups{col 67}={res}{col 69}       160

{col 49}{txt}Obs per group:
{col 63}{txt}min{col 67}={res}{col 69}        14
{col 63}{txt}avg{col 67}={res}{col 69}      44.9
{col 63}{txt}max{col 67}={res}{col 69}        67

{txt}Integration method: {col 21}{res}mvaghermite{col 49}{txt}Integration pts.{col 67}={col 78}{res}7

{col 49}{txt}Wald chi2({res}5{txt}){col 67}={res}{col 70}   483.33
{txt}Log likelihood = {res}-4455.9081{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mathgroup{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}female {c |}{col 14}{res}{space 2}  -.32004{col 26}{space 2} .0571132{col 37}{space 1}   -5.60{col 46}{space 3}0.000{col 54}{space 4}-.4319798{col 67}{space 3}-.2081003
{txt}{space 9}ses {c |}{col 14}{res}{space 2} .6061583{col 26}{space 2} .0398911{col 37}{space 1}   15.20{col 46}{space 3}0.000{col 54}{space 4} .5279733{col 67}{space 3} .6843434
{txt}{space 5}meanses {c |}{col 14}{res}{space 2} .8865231{col 26}{space 2} .1199975{col 37}{space 1}    7.39{col 46}{space 3}0.000{col 54}{space 4} .6513323{col 67}{space 3} 1.121714
{txt}{space 8}size {c |}{col 14}{res}{space 2} .0001412{col 26}{space 2} .0000777{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-.0000111{col 67}{space 3} .0002936
{txt}{space 6}sector {c |}{col 14}{res}{space 2} .4156577{col 26}{space 2} .1017318{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .2162671{col 67}{space 3} .6150483
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1954753{col 26}{space 2} .1244737{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-.4394392{col 67}{space 3} .0484886
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}schoolid    {col 14}{txt}{c |}
   var(_cons){c |}{col 14}{res}{space 2} .1822203{col 26}{space 2} .0351234{col 54}{space 4} .1248895{col 67}{space 3}  .265869
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test vs. logistic model: {txt}{help j_chibar##|_new:chibar2(01) =}{res} 102.66{col 55}{txt}Prob >= chibar2 = {res}{col 73}0.0000
{txt}
{com}. //_13
. melogit, or

{txt}Mixed-effects logistic regression{col 49}{txt}Number of obs{col 67}={res}{col 69}     7,185
{txt}Group variable: {col 24}{res}schoolid{col 49}{txt}Number of groups{col 67}={res}{col 69}       160

{col 49}{txt}Obs per group:
{col 63}{txt}min{col 67}={res}{col 69}        14
{col 63}{txt}avg{col 67}={res}{col 69}      44.9
{col 63}{txt}max{col 67}={res}{col 69}        67

{txt}Integration method: {col 21}{res}mvaghermite{col 49}{txt}Integration pts.{col 67}={col 78}{res}7

{col 49}{txt}Wald chi2({res}5{txt}){col 67}={res}{col 70}   483.33
{txt}Log likelihood = {res}-4455.9081{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   mathgroup{col 14}{c |} Odds Ratio{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}female {c |}{col 14}{res}{space 2}   .72612{col 26}{space 2}  .041471{col 37}{space 1}   -5.60{col 46}{space 3}0.000{col 54}{space 4} .6492225{col 67}{space 3} .8121256
{txt}{space 9}ses {c |}{col 14}{res}{space 2} 1.833375{col 26}{space 2} .0731353{col 37}{space 1}   15.20{col 46}{space 3}0.000{col 54}{space 4} 1.695493{col 67}{space 3}  1.98247
{txt}{space 5}meanses {c |}{col 14}{res}{space 2} 2.426678{col 26}{space 2} .2911952{col 37}{space 1}    7.39{col 46}{space 3}0.000{col 54}{space 4} 1.918095{col 67}{space 3} 3.070111
{txt}{space 8}size {c |}{col 14}{res}{space 2} 1.000141{col 26}{space 2} .0000777{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4} .9999889{col 67}{space 3} 1.000294
{txt}{space 6}sector {c |}{col 14}{res}{space 2} 1.515367{col 26}{space 2}  .154161{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} 1.241434{col 67}{space 3} 1.849746
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8224437{col 26}{space 2} .1023726{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4} .6443977{col 67}{space 3} 1.049683
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}schoolid    {col 14}{txt}{c |}
   var(_cons){c |}{col 14}{res}{space 2} .1822203{col 26}{space 2} .0351234{col 54}{space 4} .1248895{col 67}{space 3}  .265869
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}
{p 0 6 2}Note: {res:_cons} estimates baseline odds (conditional on zero random effects){txt}.{p_end}
{txt}LR test vs. logistic model: {txt}{help j_chibar##|_new:chibar2(01) =}{res} 102.66{col 55}{txt}Prob >= chibar2 = {res}{col 73}0.0000
{txt}
{com}. //_14
. estat icc

{txt}Residual intraclass correlation

{res}{col 1}{text}{hline 29}{c TT}{hline 12}{hline 12}{hline 12}{hline 12}
{col 1}{text}                       Level{col 30}{c |}        ICC{col 43}  Std. Err.{col 55}    [95% Conf. Interval]
{res}{col 1}{text}{hline 29}{c +}{hline 12}{hline 12}{hline 12}{hline 12}
{col 1}{text}                    schoolid{col 30}{c |}{result}{space 2} .0524815{col 43}{space 1}  .009585{col 55}{space 3} .0365734{col 67}{space 3} .0747718
{col 1}{text}{hline 29}{c BT}{hline 12}{hline 12}{hline 12}{hline 12}
{res}{txt}
{com}. //_15
. clear all
{res}{txt}
{com}. //_16
. twoway (function y = logistic(x), range(-5 5)) /// first school; random intercept 0
> (function y = logistic(x + 1), range(-5 5)) /// second school; random intercept 1
> (function y = logistic(x - 1), range(-5 5)), /// third school; random intercept -1
> title("Three Hypothetical Schools") ///
> sub("With Different Random Intercepts") ///
> legend(order(1 "random intercept 0" 2 "random intercept +1" 3 "random intercept -1")) ///
> scheme(michigan)
{res}{txt}
{com}. //_17
. graph export myMLM.png, width(1000) replace
{txt}(file /Users/agrogan/Desktop/newstuff/categorical/multilevel/myMLM.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/multilevel/multilevel.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Feb 2021, 14:50:49
{txt}{.-}
{smcl}
{txt}{sf}{ul off}