{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/causal-modeling/causal-modeling.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Dec 2020, 09:47:56
{txt}
{com}. //_1
. display c(current_date)
{res} 4 Dec 2020
{txt}
{com}. //_2
. display c(current_time)
{res}09:47:56
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. cd "/Users/agrogan/Desktop/newstuff/causal-modeling"
{res}/Users/agrogan/Desktop/newstuff/causal-modeling
{txt}
{com}. //_5
. use "GSS_panel2010w123_R6 - stata.dta", clear
{txt}
{com}. //_6
. generate ID = id_1
{txt}
{com}. //_7
. keep ID satjob_? educ_? race_? incom16_?
{txt}
{com}. //_8
. describe

{txt}Contains data from {res}GSS_panel2010w123_R6 - stata.dta
{txt}  obs:{res}         2,044                          
{txt} vars:{res}            13                          5 Jul 2020 13:27
{txt} size:{res}        32,704                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:educ_1         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:EDUC_1   }{bind:  }{res}{res}educ_1: HIGHEST YEAR OF SCHOOL COMPLETED{p_end}
{p 0 48}{bind:educ_2         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:EDUC_2   }{bind:  }{res}{res}educ_2: HIGHEST YEAR OF SCHOOL COMPLETED{p_end}
{p 0 48}{bind:educ_3         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:EDUC_3   }{bind:  }{res}{res}educ_3: HIGHEST YEAR OF SCHOOL COMPLETED{p_end}
{p 0 48}{bind:incom16_1      }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:INCOM16  }{bind:  }{res}{res}incom16_1: RS FAMILY INCOME WHEN 16 YRS OLD{p_end}
{p 0 48}{bind:incom16_2      }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V1318_A  }{bind:  }{res}{res}incom16_2: RS FAMILY INCOME WHEN 16 YRS OLD{p_end}
{p 0 48}{bind:incom16_3      }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:V1319_A  }{bind:  }{res}{res}incom16_3: RS FAMILY INCOME WHEN 16 YRS OLD{p_end}
{p 0 48}{bind:race_1         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:RACE_1   }{bind:  }{res}{res}race_1: RACE OF RESPONDENT{p_end}
{p 0 48}{bind:race_2         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:RACE_2   }{bind:  }{res}{res}race_2: RACE OF RESPONDENT{p_end}
{p 0 48}{bind:race_3         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:RACE_3   }{bind:  }{res}{res}race_3: RACE OF RESPONDENT{p_end}
{p 0 48}{bind:satjob_1       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:SATJOB_1 }{bind:  }{res}{res}satjob_1: JOB OR HOUSEWORK{p_end}
{p 0 48}{bind:satjob_2       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:SATJOB_2 }{bind:  }{res}{res}satjob_2: JOB OR HOUSEWORK{p_end}
{p 0 48}{bind:satjob_3       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:SATJOB_3 }{bind:  }{res}{res}satjob_3: JOB OR HOUSEWORK{p_end}
{p 0 48}{bind:ID             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_9
. codebook satjob_3

{txt}{hline}
{res}satjob_3{right:satjob_3: JOB OR HOUSEWORK}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})
{ralign 22:label}:  {res:SATJOB_3}

{col 18}range:  [{res}1{txt},{res}4{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}4{col 51}{txt}missing .:  {res}0{txt}/{res}2,044
{col 8}{txt}unique mv codes:  {res}3{col 50}{txt}missing .*:  {res}1,086{txt}/{res}2,044

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}       483{col 33}       1{col 43}{txt}VERY SATISFIED
{col 21}{res}       367{col 33}       2{col 43}{txt}MOD. SATISFIED
{col 21}{res}        69{col 33}       3{col 43}{txt}A LITTLE DISSAT
{col 21}{res}        39{col 33}       4{col 43}{txt}VERY DISSATISFIED
{col 21}{res}         4{col 33}      .d{col 43}{txt}DK
{col 21}{res}     1,073{col 33}      .i{col 43}{txt}IAP
{col 21}{res}         9{col 33}      .n{col 43}{txt}NA

{com}. //_10
. pwcorr satjob_3 educ_3, sig

             {txt}{c |} satjob_3   educ_3
{hline 13}{c +}{hline 18}
    satjob_3 {c |} {res}  1.0000 
             {txt}{c |}
             {c |}
      educ_3 {c |} {res} -0.0774   1.0000 
             {txt}{c |}{res}   0.0166
             {txt}{c |}

{com}. //_11
. regress satjob_3 educ_3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       957
{txt}{hline 13}{c +}{hline 34}   F(1, 955)       = {res}     5.76
{txt}       Model {c |} {res} 3.53828635         1  3.53828635   {txt}Prob > F        ={res}    0.0166
{txt}    Residual {c |} {res} 586.493062       955   .61412886   {txt}R-squared       ={res}    0.0060
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0050
{txt}       Total {c |} {res} 590.031348       956  .617187602   {txt}Root MSE        =   {res} .78366

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    satjob_3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}educ_3 {c |}{col 14}{res}{space 2}-.0216864{col 26}{space 2} .0090349{col 37}{space 1}   -2.40{col 46}{space 3}0.017{col 54}{space 4}-.0394169{col 67}{space 3} -.003956
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.954439{col 26}{space 2} .1297867{col 37}{space 1}   15.06{col 46}{space 3}0.000{col 54}{space 4} 1.699739{col 67}{space 3} 2.209139
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_12
. regress satjob_3 educ_3 i.race_3 incom16_3 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       951
{txt}{hline 13}{c +}{hline 34}   F(4, 946)       = {res}     2.36
{txt}       Model {c |} {res} 5.81703392         4  1.45425848   {txt}Prob > F        ={res}    0.0517
{txt}    Residual {c |} {res} 582.580442       946  .615835563   {txt}R-squared       ={res}    0.0099
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0057
{txt}       Total {c |} {res} 588.397476       950  .619365765   {txt}Root MSE        =   {res} .78475

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    satjob_3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}educ_3 {c |}{col 14}{res}{space 2}-.0215151{col 26}{space 2} .0092674{col 37}{space 1}   -2.32{col 46}{space 3}0.020{col 54}{space 4}-.0397021{col 67}{space 3}-.0033281
{txt}{space 12} {c |}
{space 6}race_3 {c |}
{space 6}black  {c |}{col 14}{res}{space 2} .1267666{col 26}{space 2} .0708898{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4}-.0123528{col 67}{space 3} .2658861
{txt}{space 6}other  {c |}{col 14}{res}{space 2} .0677238{col 26}{space 2} .0985112{col 37}{space 1}    0.69{col 46}{space 3}0.492{col 54}{space 4}-.1256019{col 67}{space 3} .2610495
{txt}{space 12} {c |}
{space 3}incom16_3 {c |}{col 14}{res}{space 2} .0115275{col 26}{space 2} .0280601{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 54}{space 4}-.0435398{col 67}{space 3} .0665947
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.89556{col 26}{space 2}  .144649{col 37}{space 1}   13.10{col 46}{space 3}0.000{col 54}{space 4}  1.61169{col 67}{space 3}  2.17943
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_13
. generate twelve_years_3 = educ_3 >= 12 // 12 or more years of education
{txt}
{com}. //_14
. generate twelve_years_2 = educ_2 >= 12 // 12 or more years of education
{txt}
{com}. //_15
. generate twelve_years_1 = educ_1 >= 12 // 12 or more years of education
{txt}
{com}. //_16
. label variable twelve_years_3 "12 or more years of education"
{txt}
{com}. //_17
. label variable twelve_years_2 "12 or more years of education"
{txt}
{com}. //_18
. label variable twelve_years_1 "12 or more years of education"
{txt}
{com}. //_19
. teffects psmatch (satjob_3) (twelve_years_3 incom16_3 i.race_3)
{res}
{txt}Treatment-effects estimation{col 48}Number of obs {col 67}= {res}       952
{txt:Estimator}{col 16}:{res: propensity-score matching}{col 48}{txt:Matches: requested }{col 67}{txt:=}          1
{txt:Outcome model}{col 16}:{res: matching}{txt}{col 63}min {col 67}= {res}         1
{txt:Treatment model}{col 16}:{res: logit}{col 63}{txt:max }{col 67}{txt:=}        296
{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}   AI Robust
{col 1}      satjob_3{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      z{col 48}   P>|z|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}ATE            {txt}{c |}
twelve_years_3 {c |}
{space 5}(1 vs 0)  {c |}{col 16}{res}{space 2}-.0410168{col 28}{space 2} .1083808{col 39}{space 1}   -0.38{col 48}{space 3}0.705{col 56}{space 4}-.2534393{col 69}{space 3} .1714057
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_20
. tebalance summarize
{txt}{p 0 6 2}note: refitting the model using the {bf:generate()} option{p_end}
{res}
{txt}{p 2 0 2}Covariate balance summary{p_end}
{res}{col 42}{text}          Raw{col 55}      Matched
{res}{col 27}{text}{hline 15}{hline 13}{hline 13}
{col 27}{text}Number of obs ={col 42}{result}{space 3}       952{col 55}{space 3}     1,904
{col 27}{text}Treated obs   ={col 42}{result}{space 3}       854{col 55}{space 3}       952
{col 27}{text}Control obs   ={col 42}{result}{space 3}        98{col 55}{space 3}       952
{col 27}{text}{hline 15}{hline 13}{hline 13}

{res}{col 3}{text}{hline 16}{c TT}{hline 24}{hline 24}
{col 19}{text}{c |}Standardized differences{col 44}          Variance ratio
{res}{col 19}{text}{c |}        Raw{col 32}    Matched{col 44}          Raw{col 56}    Matched
{res}{col 3}{text}{hline 16}{c +}{hline 12}{hline 12}{hline 12}{hline 12}
{col 3}{text}      incom16_3{col 19}{c |}{result}{space 2} .5429864{col 32}{space 2}-.0077616{col 44}{space 4} .9418824{col 56}{space 2} .9726307
{col 19}{text}{c |}
{res}{col 3}{text}         race_3{col 19}{c |}
{res}{col 3}{text}         black{col 19}{c |}{result}{space 2}-.1354119{col 32}{space 2}-.0199848{col 44}{space 4} .7873145{col 56}{space 2} .9638265
{col 3}{text}         other{col 19}{c |}{result}{space 2}-.0248378{col 32}{space 2} .0326166{col 44}{space 4} .9163586{col 56}{space 2} 1.114865
{col 3}{text}{hline 16}{c BT}{hline 12}{hline 12}{hline 12}{hline 12}
{res}{txt}
{com}. //_21
. tebalance density, scheme(michigan)
{txt}{p 0 6 2}note: refitting the model using the {bf:generate()} option{p_end}
{res}{txt}
{com}. //_22
. graph export mydensity.png, width(500) replace
{txt}(file mydensity.png written in PNG format)

{com}. //_23
. sem (satjob_3 <- twelve_years_2 incom16_2) ///
> (twelve_years_3 <- satjob_2 incom16_2), ///
> cov(e.satjob_3*e.twelve_years_3)
{res}{txt}(1164 observations with missing values excluded)

Endogenous variables

{p 0 11 2}Observed:{space 2}{res}satjob_3 twelve_years_3{p_end}
{txt}
Exogenous variables

{p 0 11 2}Observed:{space 2}{res}twelve_years_2 incom16_2 satjob_2{p_end}
{txt}
Fitting target model:

Iteration 0:{space 3}log likelihood = {res: -3673.669}  
Iteration 1:{space 3}log likelihood = {res:-3673.4349}  
Iteration 2:{space 3}log likelihood = {res:-3673.4342}  
Iteration 3:{space 3}log likelihood = {res:-3673.4342}  

{col 1}Structural equation model{col 49}Number of obs{col 67}= {res}       880
{txt}{col 1}Estimation method{col 20}= {res}ml
{txt}{col 1}Log likelihood{col 20}= {res}-3673.4342

{txt}{hline 32}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 33}{c |}{col 45}      OIM
{col 33}{c |}      Coef.{col 45}   Std. Err.{col 57}      z{col 65}   P>|z|{col 73}     [95% Con{col 86}f. Interval]
{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}Structural                     {col 33}{txt}{c |}
{space 2}{col 3}satjob_3                     {col 33}{c |}
{space 17}twelve_years_2 {c |}{col 33}{res}{space 2}-.0722619{col 45}{space 2} .1575751{col 56}{space 1}   -0.46{col 65}{space 3}0.647{col 73}{space 4}-.3811034{col 86}{space 3} .2365795
{txt}{space 22}incom16_2 {c |}{col 33}{res}{space 2}-.0024625{col 45}{space 2} .0304497{col 56}{space 1}   -0.08{col 65}{space 3}0.936{col 73}{space 4}-.0621428{col 86}{space 3} .0572177
{txt}{space 26}_cons {c |}{col 33}{res}{space 2} 1.734644{col 45}{space 2} .1378498{col 56}{space 1}   12.58{col 65}{space 3}0.000{col 73}{space 4} 1.464464{col 86}{space 3} 2.004825
{space 2}{txt}{hline 30}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}{col 3}twelve_years_3               {col 33}{c |}
{space 22}incom16_2 {c |}{col 33}{res}{space 2} .0607781{col 45}{space 2} .0108369{col 56}{space 1}    5.61{col 65}{space 3}0.000{col 73}{space 4} .0395381{col 86}{space 3} .0820181
{txt}{space 23}satjob_2 {c |}{col 33}{res}{space 2}-.0054737{col 45}{space 2} .0149476{col 56}{space 1}   -0.37{col 65}{space 3}0.714{col 73}{space 4}-.0347704{col 86}{space 3} .0238231
{txt}{space 26}_cons {c |}{col 33}{res}{space 2} .7396908{col 45}{space 2} .0427695{col 56}{space 1}   17.29{col 65}{space 3}0.000{col 73}{space 4} .6558642{col 86}{space 3} .8235175
{txt}{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
                 var(e.satjob_3){c |}{col 33}{res}{space 2} .6046871{col 45}{space 2} .0288304{col 73}{space 4} .5507404{col 86}{space 3} .6639181
{txt}           var(e.twelve_years_3){c |}{col 33}{res}{space 2} .0868092{col 45}{space 2} .0041385{col 73}{space 4} .0790653{col 86}{space 3} .0953116
{txt}{hline 32}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
cov(e.satjob_3,e.twelve_years_3){c |}{col 33}{res}{space 2} .0016217{col 45}{space 2} .0154575{col 56}{space 1}    0.10{col 65}{space 3}0.916{col 73}{space 4}-.0286744{col 86}{space 3} .0319178
{txt}{hline 32}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of model vs. saturated: chi2({res:2})   = {res:   968.48}, Prob > chi2 = {res}0.0000
{txt}
{com}. //_24
. reshape long satjob_ educ_ twelve_years_ incom16_ race_, i(ID) j(wave)
{txt}(note: j = 1 2 3)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    2044   {txt}->{res}    6132
{txt}Number of variables            {res}      16   {txt}->{res}       7
{txt}j variable (3 values)                     ->   {res}wave
{txt}xij variables:
             {res}satjob_1 satjob_2 satjob_3   {txt}->   {res}satjob_
                   educ_1 educ_2 educ_3   {txt}->   {res}educ_
twelve_years_1 twelve_years_2 twelve_years_3{txt}-> {res}twelve_years_
          incom16_1 incom16_2 incom16_3   {txt}->   {res}incom16_
                   race_1 race_2 race_3   {txt}->   {res}race_
{txt}{hline 77}

{com}. //_25
. rename satjob_ satjob
{res}{txt}
{com}. //_26
. rename educ_ educ
{res}{txt}
{com}. //_27
. rename incom16_ incom16
{res}{txt}
{com}. //_28
. rename race_ race
{res}{txt}
{com}. //_29
. rename twelve_years_ twelve_years
{res}{txt}
{com}. //_30
. mixed satjob wave educ incom16 i.race || ID: 
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -4161.775}  
{res}{txt}Iteration 1:{space 3}log likelihood = {res:-4161.7476}  
{res}{txt}Iteration 2:{space 3}log likelihood = {res:-4161.7476}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}     3,595
{txt}Group variable: {res}ID{col 49}{txt}Number of groups{col 67}={col 69}{res}     1,661

{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.2
{txt}{col 63}max{col 67}={col 69}{res}         3

{col 49}{txt}Wald chi2({res}5{txt}){col 67}={col 70}{res}    42.38
{txt}Log likelihood = {res}-4161.7476{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      satjob{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}wave {c |}{col 14}{res}{space 2} -.018625{col 26}{space 2}  .014015{col 37}{space 1}   -1.33{col 46}{space 3}0.184{col 54}{space 4}-.0460938{col 67}{space 3} .0088439
{txt}{space 8}educ {c |}{col 14}{res}{space 2} -.018976{col 26}{space 2} .0054133{col 37}{space 1}   -3.51{col 46}{space 3}0.000{col 54}{space 4}-.0295859{col 67}{space 3} -.008366
{txt}{space 5}incom16 {c |}{col 14}{res}{space 2}-.0350535{col 26}{space 2} .0154559{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.0653465{col 67}{space 3}-.0047606
{txt}{space 12} {c |}
{space 8}race {c |}
{space 6}black  {c |}{col 14}{res}{space 2} .1695589{col 26}{space 2} .0451171{col 37}{space 1}    3.76{col 46}{space 3}0.000{col 54}{space 4} .0811311{col 67}{space 3} .2579868
{txt}{space 6}other  {c |}{col 14}{res}{space 2}  .035975{col 26}{space 2} .0543135{col 37}{space 1}    0.66{col 46}{space 3}0.508{col 54}{space 4}-.0704776{col 67}{space 3} .1424276
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.049073{col 26}{space 2} .0843019{col 37}{space 1}   24.31{col 46}{space 3}0.000{col 54}{space 4} 1.883845{col 67}{space 3} 2.214302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}ID{txt}: Identity{col 30}{c |}
{col 19}var(_cons){col 30}{c |}{res}{col 33} .2305185{col 44} .0161162{col 58} .2009999{col 70} .2643722
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} .4174209{col 44} .0131143{col 58} .3924927{col 70} .4439323
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}322.95{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_31
. xtreg satjob wave educ incom16 i.race, i(ID) fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     3,595
{txt}Group variable: {res}ID{txt}{col 49}Number of groups{col 67}={col 69}{res}     1,661

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0052{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0148{col 63}{txt}avg{col 67}={col 69}{res}       2.2
{txt}     overall = {res}0.0122{col 63}{txt}max{col 67}={col 69}{res}         3

{txt}{col 49}F({res}5{txt},{res}1929{txt}){col 67}={col 70}{res}     2.03
{txt}corr(u_i, Xb){col 16}= {res}-0.0714{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0711

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      satjob{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}wave {c |}{col 14}{res}{space 2}-.0237842{col 26}{space 2} .0152551{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-.0537023{col 67}{space 3}  .006134
{txt}{space 8}educ {c |}{col 14}{res}{space 2}-.0087664{col 26}{space 2} .0158008{col 37}{space 1}   -0.55{col 46}{space 3}0.579{col 54}{space 4}-.0397548{col 67}{space 3}  .022222
{txt}{space 5}incom16 {c |}{col 14}{res}{space 2} -.047186{col 26}{space 2} .0228265{col 37}{space 1}   -2.07{col 46}{space 3}0.039{col 54}{space 4}-.0919531{col 67}{space 3}-.0024189
{txt}{space 12} {c |}
{space 8}race {c |}
{space 6}black  {c |}{col 14}{res}{space 2} .3226033{col 26}{space 2} .2025604{col 37}{space 1}    1.59{col 46}{space 3}0.111{col 54}{space 4}-.0746572{col 67}{space 3} .7198637
{txt}{space 6}other  {c |}{col 14}{res}{space 2} .0383663{col 26}{space 2}  .104807{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-.1671806{col 67}{space 3} .2439132
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.928458{col 26}{space 2}  .227991{col 37}{space 1}    8.46{col 46}{space 3}0.000{col 54}{space 4} 1.481323{col 67}{space 3} 2.375593
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  .6861769
     {txt}sigma_e {c |} {res} .64822634
         {txt}rho {c |} {res} .52841711{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}1660{txt}, {res}1929{txt}) = {res}2.18{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. //_32
. bysort ID: egen educ_mean = mean(educ)
{txt}(6 missing values generated)

{com}. //_33
. generate educ_deviation = educ - educ_mean
{txt}(1,240 missing values generated)

{com}. //_34
. mixed satjob wave educ_mean educ_deviation incom16 i.race || ID:
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-4161.3224}  
{res}{txt}Iteration 1:{space 3}log likelihood = {res:-4161.2951}  
{res}{txt}Iteration 2:{space 3}log likelihood = {res:-4161.2951}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects ML regression{col 49}Number of obs{col 67}={col 69}{res}     3,595
{txt}Group variable: {res}ID{col 49}{txt}Number of groups{col 67}={col 69}{res}     1,661

{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         1
{txt}{col 63}avg{col 67}={col 69}{res}       2.2
{txt}{col 63}max{col 67}={col 69}{res}         3

{col 49}{txt}Wald chi2({res}6{txt}){col 67}={col 70}{res}    43.30
{txt}Log likelihood = {res}-4161.2951{col 49}{txt}Prob > chi2{col 67}={col 73}{res}0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        satjob{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      z{col 48}   P>|z|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}wave {c |}{col 16}{res}{space 2}-.0197009{col 28}{space 2} .0140588{col 39}{space 1}   -1.40{col 48}{space 3}0.161{col 56}{space 4}-.0472556{col 69}{space 3} .0078537
{txt}{space 5}educ_mean {c |}{col 16}{res}{space 2}-.0208983{col 28}{space 2} .0057775{col 39}{space 1}   -3.62{col 48}{space 3}0.000{col 56}{space 4}-.0322221{col 69}{space 3}-.0095745
{txt}educ_deviation {c |}{col 16}{res}{space 2}-.0054971{col 28}{space 2} .0151667{col 39}{space 1}   -0.36{col 48}{space 3}0.717{col 56}{space 4}-.0352233{col 69}{space 3} .0242292
{txt}{space 7}incom16 {c |}{col 16}{res}{space 2}-.0343579{col 28}{space 2} .0154712{col 39}{space 1}   -2.22{col 48}{space 3}0.026{col 56}{space 4}-.0646809{col 69}{space 3}-.0040349
{txt}{space 14} {c |}
{space 10}race {c |}
{space 8}black  {c |}{col 16}{res}{space 2} .1684699{col 28}{space 2} .0451261{col 39}{space 1}    3.73{col 48}{space 3}0.000{col 56}{space 4} .0800245{col 69}{space 3} .2569154
{txt}{space 8}other  {c |}{col 16}{res}{space 2} .0342568{col 28}{space 2} .0543368{col 39}{space 1}    0.63{col 48}{space 3}0.528{col 56}{space 4}-.0722414{col 69}{space 3}  .140755
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} 2.075849{col 28}{space 2}  .088866{col 39}{space 1}   23.36{col 48}{space 3}0.000{col 56}{space 4} 1.901675{col 69}{space 3} 2.250023
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}ID{txt}: Identity{col 30}{c |}
{col 19}var(_cons){col 30}{c |}{res}{col 33} .2304651{col 44} .0161097{col 58} .2009581{col 70} .2643046
{txt}{hline 29}{c +}{hline 48}
{col 16}var(Residual){col 30}{c |}{res}{col 33} .4173132{col 44} .0131099{col 58} .3923934{col 70} .4438157
{txt}{hline 29}{c BT}{hline 48}
LR test vs. linear model:{col 27}{help j_chibar##|_new:chibar2(01) =} {res}323.08{col 55}{txt}Prob >= chibar2 = {col 73}{res}0.0000
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/causal-modeling/causal-modeling.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Dec 2020, 09:48:11
{txt}{.-}
{smcl}
{txt}{sf}{ul off}