{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/logistic-regression/complete-separation.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Mar 2024, 08:33:46
{txt}
{com}. //_1
. display c(current_date)
{res}14 Mar 2024
{txt}
{com}. //_2
. use complete-separation.dta, clear
{txt}
{com}. //_3
. twoway scatter y x1, scheme(michigan)
{res}{txt}
{com}. //_4
. graph export scatter1.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/logistic-regression/scatter1.png{rm}
saved as
PNG
format
{p_end}

{com}. //_5
. twoway scatter y x2, scheme(michigan)
{res}{txt}
{com}. //_6
. graph export scatter2.png, width(1500) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/logistic-regression/scatter2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_7
. capture noisily logit y x1 x2

{txt}outcome = {bf:x1} > 3 predicts data perfectly

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/logistic-regression/complete-separation.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Mar 2024, 08:33:49
{txt}{.-}
{smcl}
{txt}{sf}{ul off}