{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/emperors/emperors.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Nov 2021, 10:30:37
{txt}
{com}. //_1
. display c(current_date)
{res}19 Nov 2021
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. import delimited "https://raw.githubusercontent.com/agrogan1/newstuff/master/categorical/survival-analysis-and-event-history/emperors/emperors.csv"
{res}{text}(16 vars, 68 obs)

{com}. //_4
. * we can't use the date() function 
. * because it does not work
. * with dates prior to 100AD
. //_5
. * generate birthdate = date(birth, "YMD")
. //_6
. * generate deathdate = date(death, "YMD")
. //_7
. generate birthyear = real(substr(birth, 1, 4)) // convert first 4 characters to real number
{txt}(5 missing values generated)

{com}. //_8
. generate deathyear = real(substr(death, 1, 4)) // convert first 4 characters to real number
{txt}
{com}. //_9
. * browse name name_full birth birthyear death deathyear
. //_10
. generate age = deathyear - birthyear
{txt}(5 missing values generated)

{com}. //_11
. * need to recalculate age for those born in BCE
. //_12
. encode cause, generate(causeNUMERIC) // numeric version of cause of death
{txt}
{com}. //_13
. codebook causeNUMERIC if age != . // show values of causeNUMERIC for non missing ages

{txt}{hline}
{res}causeNUMERIC{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}long{txt})
{ralign 22:Label}: {res:causeNUMERIC}

{col 18}Range: [{res}1{txt},{res}7{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}7{col 51}{txt}Missing .: {res}0{txt}/{res}63

{txt}{col 13}Tabulation: Freq.   Numeric  Label
{col 20}{res}        23{col 32}       1{col 42}{txt}Assassination
{col 20}{res}         1{col 32}       2{col 42}{txt}Captivity
{col 20}{res}         4{col 32}       3{col 42}{txt}Died in Battle
{col 20}{res}         8{col 32}       4{col 42}{txt}Execution
{col 20}{res}        21{col 32}       5{col 42}{txt}Natural Causes
{col 20}{res}         5{col 32}       6{col 42}{txt}Suicide
{col 20}{res}         1{col 32}       7{col 42}{txt}Unknown

{com}. //_14
. encode rise, generate(riseNUMERIC) // numeric version of cause of death
{txt}
{com}. //_15
. codebook riseNUMERIC

{txt}{hline}
{res}riseNUMERIC{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}long{txt})
{ralign 22:Label}: {res:riseNUMERIC}

{col 18}Range: [{res}1{txt},{res}8{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}8{col 51}{txt}Missing .: {res}0{txt}/{res}68

{txt}{col 13}Tabulation: Freq.   Numeric  Label
{col 20}{res}         7{col 32}       1{col 42}{txt}Appointment by Army
{col 20}{res}         4{col 32}       2{col 42}{txt}Appointment by Emperor
{col 20}{res}         3{col 32}       3{col 42}{txt}Appointment by Praetorian Guard
{col 20}{res}         7{col 32}       4{col 42}{txt}Appointment by Senate
{col 20}{res}        35{col 32}       5{col 42}{txt}Birthright
{col 20}{res}         1{col 32}       6{col 42}{txt}Election
{col 20}{res}         1{col 32}       7{col 42}{txt}Purchase
{col 20}{res}        10{col 32}       8{col 42}{txt}Seized Power

{com}. //_16
. stset age // stset the data

{txt}Survival-time data settings

{col 10}Failure event: {res}(assumed to fail at time=age)
{col 1}{txt}Observed time interval: {res}(0, age]
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}         68{txt}  total observations
{res}          5{txt}  event time missing (age>=.){col 61}PROBABLE ERROR
{res}          2{txt}  observations end on or before {bf:enter()}
{hline 74}
{res}         61{txt}  observations remaining, representing
{res}         61{txt}  failures in single-record/single-failure data
{res}      2,984{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res}       79
{txt}
{com}. //_17
. sts graph, scheme(michigan)

{col 9}{txt}Failure {bf:_d}: {res}1{txt} (meaning all fail)
{col 3}Analysis time {bf:_t}: {res}age
{txt}
{com}. //_18
. graph export mysurvival0.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/emperors/mysurvival0.png{rm}
saved as
PNG
format
{p_end}

{com}. //_19
. sts graph, by(causeNUMERIC) scheme(michigan) // survival curve by cause of death

{col 9}{txt}Failure {bf:_d}: {res}1{txt} (meaning all fail)
{col 3}Analysis time {bf:_t}: {res}age
{txt}
{com}. //_20
. graph export mysurvival1.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/emperors/mysurvival1.png{rm}
saved as
PNG
format
{p_end}

{com}. //_21
. tabulate age causeNUMERIC if causeNUMERIC == 3

           {txt}{c |} causeNUMER
           {c |}     IC
       age {c |} Died in B {c |}     Total
{hline 11}{c +}{hline 11}{c +}{hline 10}
        19 {c |}{res}         1 {txt}{c |}{res}         1 
{txt}        32 {c |}{res}         1 {txt}{c |}{res}         1 
{txt}        50 {c |}{res}         2 {txt}{c |}{res}         2 
{txt}{hline 11}{c +}{hline 11}{c +}{hline 10}
     Total {c |}{res}         4 {txt}{c |}{res}         4 
{txt}
{com}. //_22
. sts graph, by(causeNUMERIC) scheme(michigan) ///
> legend(pos(6) col(2) order(1 "Assasination" 2 "Captivity" 3 "Died in Battle" /// 
> 4 "Execution" 5 "Natural Causes" 6 "Suicide" 7 "Unknown")) // survival curve w better legend

{col 9}{txt}Failure {bf:_d}: {res}1{txt} (meaning all fail)
{col 3}Analysis time {bf:_t}: {res}age
{txt}
{com}. //_23
. graph export mysurvival2.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/emperors/mysurvival2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_24
. stcox ib5.causeNUMERIC ib5.riseNUMERIC // Cox model

{col 9}{txt}Failure {bf:_d}: {res}1{txt} (meaning all fail)
{col 3}Analysis time {bf:_t}: {res}age

{txt}Iteration 0:   log likelihood = {res}-194.21354
{txt}Iteration 1:   log likelihood = {res}-183.48964
{txt}Iteration 2:   log likelihood = {res}-183.01318
{txt}Iteration 3:   log likelihood = {res}-183.00966
{txt}Iteration 4:   log likelihood = {res}-183.00966
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-183.00966

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 5:61}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:61}
{txt}No. of failures = {res}{ralign 5:61}
{txt}Time at risk    = {res}{ralign 5:2,984}
{col 57}{txt}{lalign 13:LR chi2({res:13})} = {res}{ralign 6:22.41}
{txt}Log likelihood = {res}-183.00966{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0494}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                 _t{col 21}{c |} Haz. ratio{col 33}   Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}causeNUMERIC {c |}
{space 5}Assassination  {c |}{col 21}{res}{space 2} 2.903395{col 33}{space 2} 1.087888{col 44}{space 1}    2.84{col 53}{space 3}0.004{col 61}{space 4} 1.393044{col 74}{space 3} 6.051281
{txt}{space 9}Captivity  {c |}{col 21}{res}{space 2} .6157704{col 33}{space 2} .7019255{col 44}{space 1}   -0.43{col 53}{space 3}0.671{col 61}{space 4} .0659359{col 74}{space 3} 5.750634
{txt}{space 4}Died in Battle  {c |}{col 21}{res}{space 2} 3.190409{col 33}{space 2} 1.898109{col 44}{space 1}    1.95{col 53}{space 3}0.051{col 61}{space 4} .9941017{col 74}{space 3}  10.2391
{txt}{space 9}Execution  {c |}{col 21}{res}{space 2} 1.262384{col 33}{space 2} .5780177{col 44}{space 1}    0.51{col 53}{space 3}0.611{col 61}{space 4} .5145707{col 74}{space 3} 3.096976
{txt}{space 11}Suicide  {c |}{col 21}{res}{space 2} 1.420734{col 33}{space 2} .9364432{col 44}{space 1}    0.53{col 53}{space 3}0.594{col 61}{space 4} .3903581{col 74}{space 3} 5.170852
{txt}{space 11}Unknown  {c |}{col 21}{res}{space 2} .9040191{col 33}{space 2} .9428808{col 44}{space 1}   -0.10{col 53}{space 3}0.923{col 61}{space 4} .1170536{col 74}{space 3} 6.981847
{txt}{space 19} {c |}
{space 8}riseNUMERIC {c |}
Appointment by A..  {c |}{col 21}{res}{space 2} .5067648{col 33}{space 2}  .252628{col 44}{space 1}   -1.36{col 53}{space 3}0.173{col 61}{space 4} .1907536{col 74}{space 3} 1.346295
{txt}Appointment by E..  {c |}{col 21}{res}{space 2} .7952664{col 33}{space 2} .5753412{col 44}{space 1}   -0.32{col 53}{space 3}0.752{col 61}{space 4} .1926215{col 74}{space 3} 3.283375
{txt}Appointment by P..  {c |}{col 21}{res}{space 2} .2160533{col 33}{space 2} .1461524{col 44}{space 1}   -2.27{col 53}{space 3}0.024{col 61}{space 4}  .057379{col 74}{space 3} .8135208
{txt}Appointment by S..  {c |}{col 21}{res}{space 2} .2247029{col 33}{space 2} .1196918{col 44}{space 1}   -2.80{col 53}{space 3}0.005{col 61}{space 4} .0791046{col 74}{space 3} .6382865
{txt}{space 10}Election  {c |}{col 21}{res}{space 2}  1.07545{col 33}{space 2} 1.123459{col 44}{space 1}    0.07{col 53}{space 3}0.944{col 61}{space 4} .1388001{col 74}{space 3} 8.332792
{txt}{space 10}Purchase  {c |}{col 21}{res}{space 2} .5483916{col 33}{space 2}  .596986{col 44}{space 1}   -0.55{col 53}{space 3}0.581{col 61}{space 4} .0649325{col 74}{space 3} 4.631477
{txt}{space 6}Seized Power  {c |}{col 21}{res}{space 2} .4053515{col 33}{space 2} .1654931{col 44}{space 1}   -2.21{col 53}{space 3}0.027{col 61}{space 4} .1821005{col 74}{space 3} .9023027
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_25
. stcurve, survival at(causeNUMERIC=(1(1)7)) ///
> scheme(michigan) // basic survival curve by causeNUMERIC
{res}{txt}
{com}. //_26
. graph export mycox1.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/emperors/mycox1.png{rm}
saved as
PNG
format
{p_end}

{com}. //_27
. stcurve, survival ///
> at(causeNUMERIC=(1(1)7)) ///
> caption("Roman Emperors Data") ///
> legend(order(1 "Assasination" 2 "Captivity" 3 "Died in Battle" /// 
> 4 "Execution" 5 "Natural Causes" 6 "Suicide" 7 "Unknown")) ///
> scheme(michigan) // more nicely formatted survival curve
{res}{txt}
{com}. //_28
. graph export mycox2.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/emperors/mycox2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_29
. estat phtest, detail // formal test of PH assumption

{txt}Test of proportional-hazards assumption

Time function: Analysis time
{hline 13}{c TT}{hline 42}
             {c |}        rho     chi2       df    Prob>chi2
{hline 13}{c +}{hline 42}
{col 1}1.causeNUM~C{col 14}{c |}{res}{col 18}-0.04848{col 26}     0.17{col 39}    1{col 51}0.6819
{txt}{col 1}2.causeNUM~C{col 14}{c |}{res}{col 18} 0.00996{col 26}     0.01{col 39}    1{col 51}0.9397
{txt}{col 1}3.causeNUM~C{col 14}{c |}{res}{col 18} 0.01796{col 26}     0.02{col 39}    1{col 51}0.8869
{txt}{col 1}4.causeNUM~C{col 14}{c |}{res}{col 18}-0.15154{col 26}     1.62{col 39}    1{col 51}0.2032
{txt}{col 1}5b.causeNU~C{col 14}{c |}{res}{col 18}       .{col 26}        .{col 39}    1{col 51}    .
{txt}{col 1}6.causeNUM~C{col 14}{c |}{res}{col 18}-0.31746{col 26}    10.60{col 39}    1{col 51}0.0011
{txt}{col 1}7.causeNUM~C{col 14}{c |}{res}{col 18} 0.13799{col 26}     1.11{col 39}    1{col 51}0.2912
{txt}{col 1}1.riseNUME~C{col 14}{c |}{res}{col 18} 0.18269{col 26}     2.18{col 39}    1{col 51}0.1399
{txt}{col 1}2.riseNUME~C{col 14}{c |}{res}{col 18} 0.30901{col 26}     8.28{col 39}    1{col 51}0.0040
{txt}{col 1}3.riseNUME~C{col 14}{c |}{res}{col 18} 0.10627{col 26}     0.77{col 39}    1{col 51}0.3790
{txt}{col 1}4.riseNUME~C{col 14}{c |}{res}{col 18} 0.10649{col 26}     0.95{col 39}    1{col 51}0.3304
{txt}{col 1}5b.riseNUM~C{col 14}{c |}{res}{col 18}       .{col 26}        .{col 39}    1{col 51}    .
{txt}{col 1}6.riseNUME~C{col 14}{c |}{res}{col 18} 0.12455{col 26}     0.91{col 39}    1{col 51}0.3402
{txt}{col 1}7.riseNUME~C{col 14}{c |}{res}{col 18} 0.18581{col 26}     2.10{col 39}    1{col 51}0.1477
{txt}{col 1}8.riseNUME~C{col 14}{c |}{res}{col 18} 0.23405{col 26}     3.44{col 39}    1{col 51}0.0638
{txt}{hline 13}{c +}{hline 42}
 Global test {c |}{res}{col 26}    21.90{col 39}   13{col 51}0.0569
{txt}{hline 13}{c BT}{hline 42}

{com}. //_30
. stphplot, by(causeNUMERIC) scheme(michigan) // graphical test of PH assumption

{col 9}{txt}Failure {bf:_d}: {res}1{txt} (meaning all fail)
{col 3}Analysis time {bf:_t}: {res}age
{txt}
{com}. //_31
. graph export ph.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/emperors/ph.png{rm}
saved as
PNG
format
{p_end}

{com}. //_32
. stcox ib5.causeNUMERIC, strata(riseNUMERIC)

{col 9}{txt}Failure {bf:_d}: {res}1{txt} (meaning all fail)
{col 3}Analysis time {bf:_t}: {res}age

{txt}Iteration 0:   log likelihood = {res}-110.21173
{txt}Iteration 1:   log likelihood = {res}-106.78694
{txt}Iteration 2:   log likelihood = {res}-106.44767
{txt}Iteration 3:   log likelihood = {res}-106.33876
{txt}Iteration 4:   log likelihood = {res}-106.30024
{txt}Iteration 5:   log likelihood = {res}-106.28627
{txt}Iteration 6:   log likelihood = {res}-106.28115
{txt}Iteration 7:   log likelihood = {res}-106.27928
{txt}Iteration 8:   log likelihood = {res}-106.27859
{txt}Iteration 9:   log likelihood = {res}-106.27833
{txt}Iteration 10:  log likelihood = {res}-106.27824
{txt}Iteration 11:  log likelihood = {res}-106.27821
{txt}Iteration 12:  log likelihood = {res}-106.27819
{txt}Iteration 13:  log likelihood = {res}-106.27819
{txt}Iteration 14:  log likelihood = {res}-106.27819
{txt}Iteration 15:  log likelihood = {res}-106.27819
{txt}Iteration 16:  log likelihood = {res}-106.27819
{txt}Iteration 17:  log likelihood = {res}-106.27819
{txt}Iteration 18:  log likelihood = {res}-106.27819
{txt}Iteration 19:  log likelihood = {res}-106.27819
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-106.27819
{txt}Iteration 1:   log likelihood = {res}-106.27819
{txt}Iteration 2:   log likelihood = {res}-106.27819
{txt}Iteration 3:   log likelihood = {res}-106.27819
{txt}Iteration 4:   log likelihood = {res}-106.27819
{txt}Iteration 5:   log likelihood = {res}-106.27819
{txt}Iteration 6:   log likelihood = {res}-106.27819
{txt}Iteration 7:   log likelihood = {res}-106.27819
{txt}Iteration 8:   log likelihood = {res}-106.27819
{txt}Iteration 9:   log likelihood = {res}-106.27819
{txt}Iteration 10:  log likelihood = {res}-106.27819
{txt}Iteration 11:  log likelihood = {res}-106.27819
{txt}Iteration 12:  log likelihood = {res}-106.27819
{txt}Iteration 13:  log likelihood = {res}-106.27819
{txt}Iteration 14:  log likelihood = {res}-106.27819

{txt}Stratified Cox regression with Breslow method for ties
Strata variable: {res:riseNUMERIC}

No. of subjects = {res}{ralign 5:61}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:61}
{txt}No. of failures = {res}{ralign 5:61}
{txt}Time at risk    = {res}{ralign 5:2,984}
{col 57}{txt}{lalign 13:LR chi2({res:6})} = {res}{ralign 6:7.87}
{txt}Log likelihood = {res}-106.27819{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.2480}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}             _t{col 17}{c |} Haz. ratio{col 29}   Std. err.{col 41}      z{col 49}   P>|z|{col 57}     [95% con{col 70}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}causeNUMERIC {c |}
{space 1}Assassination  {c |}{col 17}{res}{space 2} 2.055452{col 29}{space 2} .7768999{col 40}{space 1}    1.91{col 49}{space 3}0.057{col 57}{space 4} .9798928{col 70}{space 3} 4.311578
{txt}{space 5}Captivity  {c |}{col 17}{res}{space 2} 2.30e-15{col 29}{space 2} 4.51e-08{col 40}{space 1}   -0.00{col 49}{space 3}1.000{col 57}{space 4}        0{col 70}{space 3}        .
{txt}Died in Battle  {c |}{col 17}{res}{space 2} 1.888973{col 29}{space 2} 1.130025{col 40}{space 1}    1.06{col 49}{space 3}0.288{col 57}{space 4} .5848147{col 70}{space 3} 6.101451
{txt}{space 5}Execution  {c |}{col 17}{res}{space 2} 1.581336{col 29}{space 2} .7416243{col 40}{space 1}    0.98{col 49}{space 3}0.328{col 57}{space 4}    .6307{col 70}{space 3}  3.96484
{txt}{space 7}Suicide  {c |}{col 17}{res}{space 2} 1.130873{col 29}{space 2}  .808074{col 40}{space 1}    0.17{col 49}{space 3}0.863{col 57}{space 4} .2787286{col 70}{space 3} 4.588243
{txt}{space 7}Unknown  {c |}{col 17}{res}{space 2} .8796497{col 29}{space 2} .9202359{col 40}{space 1}   -0.12{col 49}{space 3}0.902{col 57}{space 4} .1131969{col 70}{space 3} 6.835731
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/emperors/emperors.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}19 Nov 2021, 10:30:57
{txt}{.-}
{smcl}
{txt}{sf}{ul off}