{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/Cox-proportional-hazards-model.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Dec 2021, 16:07:50
{txt}
{com}. //_1
. display c(current_date)
{res} 5 Dec 2021
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. webuse drugtr // demonstration data set from Stata
{txt}(Patient survival in drug trial)

{com}. //_4
. stset // show st setup of data
{txt}-> stset studytime, failure(died)

Survival-time data settings

{col 10}Failure event: {res}died!=0 & died<.
{col 1}{txt}Observed time interval: {res}(0, studytime]
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}         48{txt}  total observations
{res}          0{txt}  exclusions
{hline 74}
{res}         48{txt}  observations remaining, representing
{res}         31{txt}  failures in single-record/single-failure data
{res}        744{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res}       39
{txt}
{com}. //_5
. describe // show variables in data

{txt}Contains data from {res}https://www.stata-press.com/data/r17/drugtr.dta
{txt} Observations:{res}            48                  Patient survival in drug trial
{txt}    Variables:{res}             8                  3 Mar 2020 02:12
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:studytime      }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Months to death or end of exp.{p_end}
{p 0 48}{bind:died           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 if patient died{p_end}
{p 0 48}{bind:drug           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Drug type (0=placebo){p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Patient's age at start of exp.{p_end}
{p 0 48}{bind:_st            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 if record is to be used; 0 otherwise{p_end}
{p 0 48}{bind:_d             }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 if failure; 0 if censored{p_end}
{p 0 48}{bind:_t             }{txt}{bind: byte    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Analysis time when record ends{p_end}
{p 0 48}{bind:_t0            }{txt}{bind: byte    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Analysis time when record begins{p_end}
{txt}{hline}
Sorted by: 

{com}. //_6
. sts graph, scheme(michigan) // Kaplan-Meier Survivor Function

{col 9}{txt}Failure {bf:_d}: {res}died
{col 3}{txt}Analysis time {bf:_t}: {res}studytime
{txt}
{com}. //_7
. graph export survival0.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/survival0.png{rm}
saved as
PNG
format
{p_end}

{com}. //_8
. stcox age drug // run Cox Proportional Hazards Model

{col 9}{txt}Failure {bf:_d}: {res}died
{col 3}{txt}Analysis time {bf:_t}: {res}studytime

{txt}Iteration 0:   log likelihood = {res}-99.911448
{txt}Iteration 1:   log likelihood = {res}-83.551879
{txt}Iteration 2:   log likelihood = {res}-83.324009
{txt}Iteration 3:   log likelihood = {res}-83.323546
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-83.323546

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 3:48}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:48}
{txt}No. of failures = {res}{ralign 3:31}
{txt}Time at risk    = {res}{ralign 3:744}
{col 57}{txt}{lalign 13:LR chi2({res:2})} = {res}{ralign 6:33.18}
{txt}Log likelihood = {res}-83.323546{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Haz. ratio{col 26}   Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 1.120325{col 26}{space 2} .0417711{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} 1.041375{col 67}{space 3}  1.20526
{txt}{space 8}drug {c |}{col 14}{res}{space 2} .1048772{col 26}{space 2} .0477017{col 37}{space 1}   -4.96{col 46}{space 3}0.000{col 54}{space 4} .0430057{col 67}{space 3} .2557622
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_9
. stcurve, survival scheme(michigan) // survival curve
{res}{txt}
{com}. //_10
. graph export survival1.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/survival1.png{rm}
saved as
PNG
format
{p_end}

{com}. //_11
. stcurve, survival at1(drug=0) at2(drug=1) scheme(michigan) // survival curve by group
{res}{txt}
{com}. //_12
. graph export survival2.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/survival2.png{rm}
saved as
PNG
format
{p_end}

{com}. //_13
. estat phtest // formal test of PH assumption

{txt}Test of proportional-hazards assumption

Time function: Analysis time
{hline 13}{c TT}{hline 34}
             {c |}     chi2       df       Prob>chi2
{hline 13}{c +}{hline 34}
 Global test {c |}{res}{col 15}     0.43{col 28}    2{col 43}0.8064
{txt}{hline 13}{c BT}{hline 34}

{com}. //_14
. stphplot, by(drug) scheme(michigan) // graphical test of PH assumption

{col 9}{txt}Failure {bf:_d}: {res}died
{col 3}{txt}Analysis time {bf:_t}: {res}studytime
{txt}
{com}. //_15
. graph export ph.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/ph.png{rm}
saved as
PNG
format
{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/survival-analysis-and-event-history/Cox-proportional-hazards-model.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Dec 2021, 16:07:57
{txt}{.-}
{smcl}
{txt}{sf}{ul off}