{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/survival-analysis-and-event-history/survival-analysis-and-event-history.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Dec 2020, 09:42:20
{txt}
{com}. //_1
. display c(current_date)
{res} 4 Dec 2020
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. set obs 52 // 52 hypothetical obervations
{txt}{p}
number of observations (_N)  was 0,
now 52
{p_end}

{com}. //_4
. generate id = _n // set id = to observation #
{txt}
{com}. //_5
. generate weeks = 52
{txt}
{com}. //_6
. replace weeks = 1 if id == 52
{txt}(1 real change made)

{com}. //_7
. twoway (scatter id weeks if weeks == 52, msize(small)) /// staying 52 weeks
> (scatter id weeks if weeks == 1, msize(small)), /// staying 1 week
> title("Hypothetical Hospital") ///
> legend(on order(1 "long term" 2 "short term")) ///
> xtitle("week of discharge") ///
> ylabel(1(1)52, labels labsize(tiny) angle(horizontal) noticks nogrid) /// 
> scheme(michigan)
{res}{txt}
{com}. //_8
. graph export hospital_bed_problem.png, width(1000) replace
{txt}(file hospital_bed_problem.png written in PNG format)

{com}. //_9
. clear all
{res}{txt}
{com}. //_10
. set obs 25 // 25 hypothetical obervations
{txt}{p}
number of observations (_N)  was 0,
now 25
{p_end}

{com}. //_11
. generate id = _n // set id = to observation #
{txt}
{com}. //_12
. generate time = runiform(1, 100) // random times
{txt}
{com}. //_13
. generate censored = time > 75 // censored if time > 75
{txt}
{com}. //_14
. twoway (scatter id time if censored == 0) ///
> (scatter id time if censored == 1), ///
> title("Hypothetical Timing of Events") ///
> subtitle("Think About Different Kinds of Events") ///
> note("Study Ends At Time 75") ///
> legend(on order(1 "not censored" 2 "censored")) ///
> xline(75, lcolor("red")) /// censoring line at 75
> ylabel(1(1)25, labsize(vsmall) angle(horizontal)) /// lines from 1 to 25
> scheme(michigan)
{res}{txt}
{com}. //_15
. graph export timing_of_events.png, width(1000) replace
{txt}(file timing_of_events.png written in PNG format)

{com}. //_16
. clear all
{res}{txt}
{com}. //_17
. use Pavetti.dta
{txt}(Written by R.              )

{com}. //_18
. list, abbreviate(25) // list out the data
{txt}
     {c TLC}{hline 9}{c -}{hline 14}{c -}{hline 24}{c TRC}
     {c |} {res}   time   new_entrants   all_current_recipients {txt}{c |}
     {c LT}{hline 9}{c -}{hline 14}{c -}{hline 24}{c RT}
  1. {c |} {res}   1-12           27.4                      4.5 {txt}{c |}
  2. {c |} {res}  13-24           14.8                      4.8 {txt}{c |}
  3. {c |} {res}  25-36             10                      4.9 {txt}{c |}
  4. {c |} {res}  37-48            7.7                        5 {txt}{c |}
  5. {c |} {res}  49-60            5.5                      4.5 {txt}{c |}
     {c LT}{hline 9}{c -}{hline 14}{c -}{hline 24}{c RT}
  6. {c |} {res}Over 60           34.6                     76.3 {txt}{c |}
     {c BLC}{hline 9}{c -}{hline 14}{c -}{hline 24}{c BRC}

{com}. //_19
. graph bar (asis) all_current_recipients, /// this particular set of options was difficult to figure out!
> asyvars ///
> over(time) ///
> title("All Current Recipients") ///
> sub("By Months On Caseload") ///
> ytitle("percent") ///
> scheme(michigan)
{res}{txt}
{com}. //_20
. graph export all_current_recipients.png, width(1000) replace
{txt}(file all_current_recipients.png written in PNG format)

{com}. //_21
. graph bar (asis) new_entrants, ///
> asyvars ///
> over(time) ///
> title("New Recipients") ///
> sub("By Months On Caseload") ///
> ytitle("percent") ///
> scheme(michigan)
{res}{txt}
{com}. //_22
. graph export new_recipients.png, width(1000) replace
{txt}(file new_recipients.png written in PNG format)

{com}. //_23
. clear all
{res}{txt}
{com}. //_24
. webuse drugtr // demonstration data set from Stata
{txt}(Patient Survival in Drug Trial)

{com}. //_25
. stset // show st setup of data
{txt}-> stset studytime, failure(died)

     failure event:  {res}died != 0 & died < .
{txt}obs. time interval:  {res}(0, studytime]
{txt} exit on or before:  {res}failure

{txt}{hline 78}
{res}         48{txt}  total observations
{res}          0{txt}  exclusions
{hline 78}
{res}         48{txt}  observations remaining, representing
{res}         31{txt}  failures in single-record/single-failure data
{res}        744{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res}       39
{txt}
{com}. //_26
. describe // show variables in data

{txt}Contains data from {res}http://www.stata-press.com/data/r15/drugtr.dta
{txt}  obs:{res}            48                          Patient Survival in Drug Trial
{txt} vars:{res}             8                          3 Mar 2016 02:12
{txt} size:{res}           384                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:studytime      }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Months to death or end of exp.{p_end}
{p 0 48}{bind:died           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 if patient died{p_end}
{p 0 48}{bind:drug           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Drug type (0=placebo){p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Patient's age at start of exp.{p_end}
{p 0 48}{bind:_st            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 if record is to be used; 0 otherwise{p_end}
{p 0 48}{bind:_d             }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 if failure; 0 if censored{p_end}
{p 0 48}{bind:_t             }{txt}{bind: byte    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}analysis time when record ends{p_end}
{p 0 48}{bind:_t0            }{txt}{bind: byte    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}analysis time when record begins{p_end}
{txt}{hline}
Sorted by: 

{com}. //_27
. sts graph, scheme(michigan) // Kaplan-Meier Survivor Function

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}studytime
{txt}
{com}. //_28
. graph export survival0.png, width(1000) replace
{txt}(file survival0.png written in PNG format)

{com}. //_29
. stcox age drug // run Cox Proportional Hazards Model

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}studytime

{txt}Iteration 0:   log likelihood = {res}-99.911448
{txt}Iteration 1:   log likelihood = {res}-83.551879
{txt}Iteration 2:   log likelihood = {res}-83.324009
{txt}Iteration 3:   log likelihood = {res}-83.323546
{txt}Refining estimates:
Iteration 0:   log likelihood = {res}-83.323546

{txt}Cox regression -- Breslow method for ties

No. of subjects = {res}          48                  {txt}Number of obs    =  {res}        48
{txt}No. of failures = {res}          31
{txt}Time at risk    = {res}         744
                                                {txt}LR chi2({res}2{txt})       =  {res}     33.18
{txt}Log likelihood  =   {res}-83.323546                  {txt}Prob > chi2      =  {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          _t{col 14}{c |} Haz. Ratio{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 1.120325{col 26}{space 2} .0417711{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} 1.041375{col 67}{space 3}  1.20526
{txt}{space 8}drug {c |}{col 14}{res}{space 2} .1048772{col 26}{space 2} .0477017{col 37}{space 1}   -4.96{col 46}{space 3}0.000{col 54}{space 4} .0430057{col 67}{space 3} .2557622
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_30
. stcurve, survival scheme(michigan) // survival curve
{res}{txt}
{com}. //_31
. graph export survival1.png, width(1000) replace
{txt}(file survival1.png written in PNG format)

{com}. //_32
. stcurve, survival at1(drug=0) at2(drug=1) scheme(michigan) // survival curve by group
{res}{txt}
{com}. //_33
. graph export survival2.png, width(1000) replace
{txt}(file survival2.png written in PNG format)

{com}. //_34
. estat phtest // formal test of PH assumption

{txt}      Test of proportional-hazards assumption

      Time:  {res}Time
{txt}      {hline 12}{c TT}{hline 51}
                  {c |}                      chi2       df       Prob>chi2
      {hline 12}{c +}{hline 51}
      global test {c |}{res}{col 37}     0.43{col 50}    2{col 64}0.8064
{txt}      {hline 12}{c BT}{hline 51}

{com}. //_35
. stphplot, by(drug) scheme(michigan) // graphical test of PH assumption

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}studytime
{txt}
{com}. //_36
. graph export ph.png, width(1000) replace
{txt}(file ph.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/survival-analysis-and-event-history/survival-analysis-and-event-history.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Dec 2020, 09:42:33
{txt}{.-}
{smcl}
{txt}{sf}{ul off}