{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/logistic-interactions-2/logistic-interactions-2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Nov 2022, 08:08:18
{txt}
{com}. //_1
. display c(current_date)
{res} 1 Nov 2022
{txt}
{com}. //_2
. display c(current_time)
{res}08:08:18
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. graph close _all
{txt}
{com}. //_5
. use http://www.stata-press.com/data/r15/margex, clear
{txt}(Artificial data for margins)

{com}. //_6
. describe

{txt}Contains data from {res}http://www.stata-press.com/data/r15/margex.dta
{txt} Observations:{res}         3,000                  Artificial data for margins
{txt}    Variables:{res}            11                  27 Nov 2016 14:27
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:y              }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:outcome        }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:{txt}%6.0f     }{space 1}{bind:sexlbl   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:group          }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age            }{txt}{bind: float   }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:distance       }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ycn            }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:yc             }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:treatment      }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:agegroup       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:agelab   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:arm            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}group
{txt}
{com}. //_7
. logit outcome sex##c.age i.group

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1366.0718}  
Iteration 1:{space 3}log likelihood = {res: -1118.129}  
Iteration 2:{space 3}log likelihood = {res:-1070.8227}  
Iteration 3:{space 3}log likelihood = {res:-1068.0102}  
Iteration 4:{space 3}log likelihood = {res:  -1067.99}  
Iteration 5:{space 3}log likelihood = {res:  -1067.99}  
{res}
{txt}{col 1}Logistic regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:3,000}
{txt}{col 57}{lalign 13:LR chi2({res:5})}{col 70} = {res}{ralign 6:596.16}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 8:-1067.99}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.2182}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}
{space 5}female  {c |}{col 14}{res}{space 2} .5565025{col 26}{space 2} .6488407{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-.7152019{col 67}{space 3} 1.828207
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0910807{col 26}{space 2} .0113215{col 37}{space 1}    8.04{col 46}{space 3}0.000{col 54}{space 4} .0688909{col 67}{space 3} .1132704
{txt}{space 12} {c |}
{space 3}sex#c.age {c |}
{space 5}female  {c |}{col 14}{res}{space 2} -.001211{col 26}{space 2} .0134012{col 37}{space 1}   -0.09{col 46}{space 3}0.928{col 54}{space 4}-.0274769{col 67}{space 3}  .025055
{txt}{space 12} {c |}
{space 7}group {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.5854237{col 26}{space 2} .1349791{col 37}{space 1}   -4.34{col 46}{space 3}0.000{col 54}{space 4}-.8499779{col 67}{space 3}-.3208696
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-1.355227{col 26}{space 2} .2965301{col 37}{space 1}   -4.57{col 46}{space 3}0.000{col 54}{space 4}-1.936416{col 67}{space 3}-.7740391
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-5.592272{col 26}{space 2} .5583131{col 37}{space 1}  -10.02{col 46}{space 3}0.000{col 54}{space 4}-6.686545{col 67}{space 3}-4.497998
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_8
. margins sex, at(age = (20 30 40 50 60))
{res}
{txt}{col 1}Predictive margins{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:3,000}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(outcome), predict()}{p_end}
{p2colreset}{...}
{lalign 7:1._at: }{space 0}{lalign 3:age} = {res:{ralign 2:20}}
{lalign 7:2._at: }{space 0}{lalign 3:age} = {res:{ralign 2:30}}
{lalign 7:3._at: }{space 0}{lalign 3:age} = {res:{ralign 2:40}}
{lalign 7:4._at: }{space 0}{lalign 3:age} = {res:{ralign 2:50}}
{lalign 7:5._at: }{space 0}{lalign 3:age} = {res:{ralign 2:60}}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#sex {c |}
{space 5}1#male  {c |}{col 14}{res}{space 2} .0150645{col 26}{space 2} .0047348{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0057846{col 67}{space 3} .0243445
{txt}{space 3}1#female  {c |}{col 14}{res}{space 2}  .025333{col 26}{space 2} .0055508{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .0144536{col 67}{space 3} .0362124
{txt}{space 5}2#male  {c |}{col 14}{res}{space 2} .0364848{col 26}{space 2} .0075444{col 37}{space 1}    4.84{col 46}{space 3}0.000{col 54}{space 4} .0216981{col 67}{space 3} .0512714
{txt}{space 3}2#female  {c |}{col 14}{res}{space 2} .0596255{col 26}{space 2} .0086074{col 37}{space 1}    6.93{col 46}{space 3}0.000{col 54}{space 4} .0427552{col 67}{space 3} .0764958
{txt}{space 5}3#male  {c |}{col 14}{res}{space 2} .0852689{col 26}{space 2} .0099016{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4} .0658622{col 67}{space 3} .1046757
{txt}{space 3}3#female  {c |}{col 14}{res}{space 2} .1329912{col 26}{space 2} .0108127{col 37}{space 1}   12.30{col 46}{space 3}0.000{col 54}{space 4} .1117987{col 67}{space 3} .1541838
{txt}{space 5}4#male  {c |}{col 14}{res}{space 2} .1849367{col 26}{space 2} .0163684{col 37}{space 1}   11.30{col 46}{space 3}0.000{col 54}{space 4} .1528551{col 67}{space 3} .2170182
{txt}{space 3}4#female  {c |}{col 14}{res}{space 2}  .267774{col 26}{space 2} .0156218{col 37}{space 1}   17.14{col 46}{space 3}0.000{col 54}{space 4} .2371558{col 67}{space 3} .2983921
{txt}{space 5}5#male  {c |}{col 14}{res}{space 2} .3518378{col 26}{space 2} .0408522{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4}  .271769{col 67}{space 3} .4319066
{txt}{space 3}5#female  {c |}{col 14}{res}{space 2} .4614446{col 26}{space 2} .0314754{col 37}{space 1}   14.66{col 46}{space 3}0.000{col 54}{space 4} .3997539{col 67}{space 3} .5231353
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_9
. marginsplot, ///
> scheme(michigan) /// michigan graph scheme
> plotopts(msize(vlarge)) /// larger plotting symbols
> plot1opts(lcolor(navy)) /// line for first group is navy
> plot2opts(lcolor(gold)) // line for second group is gold
{res}
{text}{p 0 0 2}Variables that uniquely identify margins: {bf:age sex}{p_end}
{res}{txt}
{com}. //_10
. graph export mymarginsplot.png, width(1000) replace
{txt}{p 0 4 2}
file {bf}
/Users/agrogan/Desktop/GitHub/newstuff/categorical/logistic-interactions-2/mymarginsplot.png{rm}
saved as
PNG
format
{p_end}

{com}. //_11
. margins sex, at(age = (20 30 40 50 60)) post
{res}
{txt}{col 1}Predictive margins{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:3,000}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(outcome), predict()}{p_end}
{p2colreset}{...}
{lalign 7:1._at: }{space 0}{lalign 3:age} = {res:{ralign 2:20}}
{lalign 7:2._at: }{space 0}{lalign 3:age} = {res:{ralign 2:30}}
{lalign 7:3._at: }{space 0}{lalign 3:age} = {res:{ralign 2:40}}
{lalign 7:4._at: }{space 0}{lalign 3:age} = {res:{ralign 2:50}}
{lalign 7:5._at: }{space 0}{lalign 3:age} = {res:{ralign 2:60}}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#sex {c |}
{space 5}1#male  {c |}{col 14}{res}{space 2} .0150645{col 26}{space 2} .0047348{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0057846{col 67}{space 3} .0243445
{txt}{space 3}1#female  {c |}{col 14}{res}{space 2}  .025333{col 26}{space 2} .0055508{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .0144536{col 67}{space 3} .0362124
{txt}{space 5}2#male  {c |}{col 14}{res}{space 2} .0364848{col 26}{space 2} .0075444{col 37}{space 1}    4.84{col 46}{space 3}0.000{col 54}{space 4} .0216981{col 67}{space 3} .0512714
{txt}{space 3}2#female  {c |}{col 14}{res}{space 2} .0596255{col 26}{space 2} .0086074{col 37}{space 1}    6.93{col 46}{space 3}0.000{col 54}{space 4} .0427552{col 67}{space 3} .0764958
{txt}{space 5}3#male  {c |}{col 14}{res}{space 2} .0852689{col 26}{space 2} .0099016{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4} .0658622{col 67}{space 3} .1046757
{txt}{space 3}3#female  {c |}{col 14}{res}{space 2} .1329912{col 26}{space 2} .0108127{col 37}{space 1}   12.30{col 46}{space 3}0.000{col 54}{space 4} .1117987{col 67}{space 3} .1541838
{txt}{space 5}4#male  {c |}{col 14}{res}{space 2} .1849367{col 26}{space 2} .0163684{col 37}{space 1}   11.30{col 46}{space 3}0.000{col 54}{space 4} .1528551{col 67}{space 3} .2170182
{txt}{space 3}4#female  {c |}{col 14}{res}{space 2}  .267774{col 26}{space 2} .0156218{col 37}{space 1}   17.14{col 46}{space 3}0.000{col 54}{space 4} .2371558{col 67}{space 3} .2983921
{txt}{space 5}5#male  {c |}{col 14}{res}{space 2} .3518378{col 26}{space 2} .0408522{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4}  .271769{col 67}{space 3} .4319066
{txt}{space 3}5#female  {c |}{col 14}{res}{space 2} .4614446{col 26}{space 2} .0314754{col 37}{space 1}   14.66{col 46}{space 3}0.000{col 54}{space 4} .3997539{col 67}{space 3} .5231353
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_12
. margins, coeflegend

{txt}{col 1}Predictive margins{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:3,000}
{txt}{col 1}Model VCE: {res:OIM}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(outcome), predict()}{p_end}
{p2colreset}{...}
{lalign 7:1._at: }{space 0}{lalign 3:age} = {res:{ralign 2:20}}
{lalign 7:2._at: }{space 0}{lalign 3:age} = {res:{ralign 2:30}}
{lalign 7:3._at: }{space 0}{lalign 3:age} = {res:{ralign 2:40}}
{lalign 7:4._at: }{space 0}{lalign 3:age} = {res:{ralign 2:50}}
{lalign 7:5._at: }{space 0}{lalign 3:age} = {res:{ralign 2:60}}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     Margin{col 26}   Legend
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#sex {c |}
{space 5}1#male  {c |}{col 14}{res}{space 2} .0150645{col 26}{txt}  _b[1bn._at#0bn.sex]
{space 3}1#female  {c |}{col 14}{res}{space 2}  .025333{col 26}{txt}  _b[1bn._at#1.sex]
{space 5}2#male  {c |}{col 14}{res}{space 2} .0364848{col 26}{txt}  _b[2._at#0bn.sex]
{space 3}2#female  {c |}{col 14}{res}{space 2} .0596255{col 26}{txt}  _b[2._at#1.sex]
{space 5}3#male  {c |}{col 14}{res}{space 2} .0852689{col 26}{txt}  _b[3._at#0bn.sex]
{space 3}3#female  {c |}{col 14}{res}{space 2} .1329912{col 26}{txt}  _b[3._at#1.sex]
{space 5}4#male  {c |}{col 14}{res}{space 2} .1849367{col 26}{txt}  _b[4._at#0bn.sex]
{space 3}4#female  {c |}{col 14}{res}{space 2}  .267774{col 26}{txt}  _b[4._at#1.sex]
{space 5}5#male  {c |}{col 14}{res}{space 2} .3518378{col 26}{txt}  _b[5._at#0bn.sex]
{space 3}5#female  {c |}{col 14}{res}{space 2} .4614446{col 26}{txt}  _b[5._at#1.sex]
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_13
. test _b[1bn._at#0bn.sex] = _b[1bn._at#1.sex] // male and female at age 20

{p 0 7}{space 1}{text:( 1)}{space 1} {res}1bn._at#0bn.sex - 1bn._at#1.sex = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    1.99
{txt}{col 10}Prob > chi2 =  {res}  0.1583
{txt}
{com}. //_14
. test _b[4._at#0bn.sex] = _b[4._at#1.sex] // male and female at age 50

{p 0 7}{space 1}{text:( 1)}{space 1} {res}4._at#0bn.sex - 4._at#1.sex = 0{p_end}

{txt}{col 12}chi2(  1) ={res}   13.03
{txt}{col 10}Prob > chi2 =  {res}  0.0003
{txt}
{com}. //_15
. test _b[5._at#0bn.sex] =  _b[5._at#1.sex] // male and female at age 60

{p 0 7}{space 1}{text:( 1)}{space 1} {res}5._at#0bn.sex - 5._at#1.sex = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    5.16
{txt}{col 10}Prob > chi2 =  {res}  0.0232
{txt}
{com}. //_16
. test _b[1bn._at#1.sex] - _b[1bn._at#0bn.sex] = _b[5._at#1.sex] - _b[5._at#0bn.sex] // test equivalence of the differences

{p 0 7}{space 1}{text:( 1)}{space 1}{space 1}{res}- 1bn._at#0bn.sex + 1bn._at#1.sex + 5._at#0bn.sex - 5._at#1.sex = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    3.62
{txt}{col 10}Prob > chi2 =  {res}  0.0572
{txt}
{com}. //_17
. test _b[1bn._at#1.sex] - _b[1bn._at#0bn.sex] = _b[4._at#1.sex] - _b[4._at#0bn.sex] // test equivalence of the differences

{p 0 7}{space 1}{text:( 1)}{space 1}{space 1}{res}- 1bn._at#0bn.sex + 1bn._at#1.sex + 4._at#0bn.sex - 4._at#1.sex = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    9.77
{txt}{col 10}Prob > chi2 =  {res}  0.0018
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/newstuff/categorical/logistic-interactions-2/logistic-interactions-2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Nov 2022, 08:08:23
{txt}{.-}
{smcl}
{txt}{sf}{ul off}