{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/predict-and-margins/predict-and-margins.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Mar 2021, 08:10:44
{txt}
{com}. //_1
. display c(current_date)
{res} 1 Mar 2021
{txt}
{com}. //_2
. display c(current_time)
{res}08:10:44
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. graph close _all
{txt}
{com}. //_5
. use http://www.stata-press.com/data/r15/margex, clear
{txt}(Artificial data for margins)

{com}. //_6
. describe

{txt}Contains data from {res}http://www.stata-press.com/data/r15/margex.dta
{txt}  obs:{res}         3,000                          Artificial data for margins
{txt} vars:{res}            11                          27 Nov 2016 14:27
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:y              }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:outcome        }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:{txt}%6.0f     }{space 1}{bind:sexlbl   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:group          }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age            }{txt}{bind: float   }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:distance       }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ycn            }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:yc             }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:treatment      }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:agegroup       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:agelab   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:arm            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}group
{txt}
{com}. //_7
. logit outcome i.sex c.age i.group, or

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1366.0718}  
Iteration 1:{space 3}log likelihood = {res:-1111.4595}  
Iteration 2:{space 3}log likelihood = {res: -1069.588}  
Iteration 3:{space 3}log likelihood = {res:     -1068}  
Iteration 4:{space 3}log likelihood = {res:-1067.9941}  
Iteration 5:{space 3}log likelihood = {res:-1067.9941}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     3,000
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    596.16
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1067.9941{txt}{col 49}Pseudo R2{col 67}= {res}    0.2182

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |} Odds Ratio{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}
{space 5}female  {c |}{col 14}{res}{space 2}  1.64734{col 26}{space 2}  .221973{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4}  1.26499{col 67}{space 3} 2.145258
{txt}{space 9}age {c |}{col 14}{res}{space 2}  1.09444{col 26}{space 2} .0070921{col 37}{space 1}   13.93{col 46}{space 3}0.000{col 54}{space 4} 1.080628{col 67}{space 3} 1.108429
{txt}{space 12} {c |}
{space 7}group {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .5568139{col 26}{space 2} .0751806{col 37}{space 1}   -4.34{col 46}{space 3}0.000{col 54}{space 4} .4273478{col 67}{space 3}  .725502
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .2566074{col 26}{space 2} .0747822{col 37}{space 1}   -4.67{col 46}{space 3}0.000{col 54}{space 4} .1449462{col 67}{space 3} .4542885
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0038757{col 26}{space 2} .0013558{col 37}{space 1}  -15.87{col 46}{space 3}0.000{col 54}{space 4} .0019524{col 67}{space 3} .0076933
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {res:_cons} estimates baseline odds{txt}.{p_end}

{com}. //_8
. margins sex, at(age = (20 30 40 50 60))
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     3,000
{txt}{col 1}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(outcome), predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}30}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}40}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}50}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#sex {c |}
{space 5}1#male  {c |}{col 14}{res}{space 2} .0153934{col 26}{space 2} .0031264{col 37}{space 1}    4.92{col 46}{space 3}0.000{col 54}{space 4} .0092657{col 67}{space 3} .0215211
{txt}{space 3}1#female  {c |}{col 14}{res}{space 2} .0250609{col 26}{space 2} .0046143{col 37}{space 1}    5.43{col 46}{space 3}0.000{col 54}{space 4} .0160171{col 67}{space 3} .0341048
{txt}{space 5}2#male  {c |}{col 14}{res}{space 2} .0369626{col 26}{space 2} .0054588{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4} .0262635{col 67}{space 3} .0476616
{txt}{space 3}2#female  {c |}{col 14}{res}{space 2} .0592151{col 26}{space 2} .0072711{col 37}{space 1}    8.14{col 46}{space 3}0.000{col 54}{space 4} .0449639{col 67}{space 3} .0734663
{txt}{space 5}3#male  {c |}{col 14}{res}{space 2} .0856677{col 26}{space 2} .0088815{col 37}{space 1}    9.65{col 46}{space 3}0.000{col 54}{space 4} .0682603{col 67}{space 3} .1030751
{txt}{space 3}3#female  {c |}{col 14}{res}{space 2} .1325688{col 26}{space 2} .0097333{col 37}{space 1}   13.62{col 46}{space 3}0.000{col 54}{space 4} .1134919{col 67}{space 3} .1516458
{txt}{space 5}4#male  {c |}{col 14}{res}{space 2} .1844578{col 26}{space 2}  .015461{col 37}{space 1}   11.93{col 46}{space 3}0.000{col 54}{space 4} .1541547{col 67}{space 3} .2147608
{txt}{space 3}4#female  {c |}{col 14}{res}{space 2} .2677423{col 26}{space 2}  .015609{col 37}{space 1}   17.15{col 46}{space 3}0.000{col 54}{space 4} .2371493{col 67}{space 3} .2983353
{txt}{space 5}5#male  {c |}{col 14}{res}{space 2}  .349279{col 26}{space 2}  .029326{col 37}{space 1}   11.91{col 46}{space 3}0.000{col 54}{space 4} .2918012{col 67}{space 3} .4067569
{txt}{space 3}5#female  {c |}{col 14}{res}{space 2} .4622129{col 26}{space 2} .0303129{col 37}{space 1}   15.25{col 46}{space 3}0.000{col 54}{space 4} .4028007{col 67}{space 3} .5216251
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_9
. marginsplot, scheme(michigan)
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: age sex{p_end}
{res}{txt}
{com}. //_10
. graph export mymarginsplot.png, width(500) replace
{txt}(file /Users/agrogan/Desktop/newstuff/categorical/predict-and-margins/mymarginsplot.png written in PNG format)

{com}. //_11
. predict yhat
{txt}(option {bf:pr} assumed; Pr(outcome))

{com}. //_12
. twoway (lowess yhat age if sex == 0) ///
> (lowess yhat age if sex == 1), ///
> title("Predicted Probabilities of Outcome") ///
> legend(order(1 "male" 2 "female")) ///
> scheme(michigan)
{res}{txt}
{com}. //_13
. graph export mytwoway.png, width(500) replace
{txt}(file /Users/agrogan/Desktop/newstuff/categorical/predict-and-margins/mytwoway.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/predict-and-margins/predict-and-margins.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Mar 2021, 08:10:52
{txt}{.-}
{smcl}
{txt}{sf}{ul off}